lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
    /* Host (mmap-backed) pointers to the norm_final + head_pose + head_camera
     * weights so we can run that tail block on CPU. The GEMVs are tiny
     * (1024×1024 + 1024×519 + 1024×3 per call); the host copies cost nothing
     * since safetensors_data() returns into the mmap. Reduces D↔H bounces in
     * the between-layer / post-loop pose+cam regression path. */
    const float *norm_final_w_h, *norm_final_b_h;        /* (1024,) */
    const float *head_pose_l0_w_h, *head_pose_l0_b_h;    /* (1024, 1024) / (1024,) */
    const float *head_pose_l1_w_h, *head_pose_l1_b_h;    /* (519, 1024)  / (519,)  */
    const float *head_camera_l0_w_h, *head_camera_l0_b_h;/* (1024, 1024) / (1024,) */
    const float *head_camera_l1_w_h, *head_camera_l1_b_h;/* (3, 1024)    / (3,)    */
} sb_dec_w;

typedef struct {
    float *data;
    int    n, c;
} f32_2d;

struct cuda_sam3d_body_ctx {
    cuda_sam3d_body_config cfg;
    int device_id;
    int verbose;
    int sm;
    hipModule_t mod;
    hipFunction_t fn_sentinel;
    hipFunction_t fn_resize, fn_patch, fn_prepend;
    hipFunction_t fn_bf16_round;
    hipFunction_t fn_ln, fn_gemm_tiled;
    hipFunction_t fn_rope_qk, fn_kv_tx, fn_fa;
    hipFunction_t fn_silu_mul, fn_layerscale_add;
    hipFunction_t fn_ray_cond_fourier, fn_conv1x1_chw, fn_ln_chw;
    hipFunction_t fn_linear_bias;
    hipFunction_t fn_gemm_f32, fn_add_two, fn_add_inplace, fn_gelu_inplace, fn_sdpa;
    hipFunction_t fn_relu_inplace, fn_grid_sample, fn_kp_pelvis_norm,
                  fn_augment_overwrite_mask;
    /* ViT-H specific kernels. */
    hipFunction_t fn_patch_pad2, fn_pos_embed_vith, fn_qkv_split;
    /* MHR-on-GPU (Step 7 — speculative). */
    hipFunction_t fn_mhr_blend;
    hipFunction_t fn_mhr_lbs;
    st_context *st_enc;
    int weights_ready;

    /* encoder weights (device ptrs). */
    void    *w_patch_w, *w_patch_b;    /* F32 (D, 3, P, P) / F32 (D,) */
    void    *w_cls;                     /* F32 (1, 1, D) */
    void    *w_storage;                 /* F32 (1, S, D) */
    void    *w_rope_periods;            /* F32 (16,) */
    void    *w_rope_cos, *w_rope_sin;   /* F32 (N_PATCH, HEAD_DIM) — built host-side */
    void    *w_norm_w, *w_norm_b;       /* F32 (D,) final LN */
    sb_block blk[SB_N_BLK];

    /* ViT-H/16 backbone (separate set; only loaded when
     * cfg.backbone == VITH). */
    void    *w_vith_pos_embed;          /* F32 (1, n_patches+1, D) */
    sb_block_vith vith_blk[SB_VITH_N_BLK];

    /* Decoder + MHR-head safetensors and uploaded weights. */
    st_context *st_dec;
    st_context *st_mhr;
    sb_dec_w    dec;

    /* CPU model + MHR assets — used in the per-layer decoder loop for
     * decode_pose_raw / mhr_forward / keypoints_from_mesh /
     * camera_project (Step 9). MHR skinning on GPU lives in Step 7
     * (deferred). cpu_mhr is NULL until cfg.mhr_assets_dir is set. */
    sam3d_body_decoder_model *cpu_dec;
    sam3d_body_mhr_assets    *cpu_mhr;

    /* device runtime buffers. */
    void    *d_img_u8;  size_t img_u8_cap;   /* (Hin, Win, 3) u8, host-resized */
    void    *d_img_f32;                       /* (3, IMG_H, IMG_W) f32 normalized */
    void    *d_tok;                           /* (N_TOK, D) f32 residual stream */
    void    *d_ln;                            /* (N_TOK, D) f32 LN scratch */
    void    *d_qkv;                           /* (N_TOK, 3D) f32 fused QKV */
    void    *d_kt, *d_vt;                     /* (HEADS, N_TOK, HEAD_DIM) */
    void    *d_attn;                          /* (N_TOK, D) attention output */
    void    *d_proj;                          /* (N_TOK, D) post-proj scratch */
    void    *d_gate, *d_up;                   /* (N_TOK, FFN) SwiGLU */

    /* host-side runtime state. */
    uint8_t *image_rgb;  int img_w, img_h;
    float    bbox[4];    int has_bbox;
    float    focal_hint;
    int      has_norm_input;  /* 1 if d_img_f32 already populated via debug API */

    /* TopdownAffine outputs cached by run_encoder so run_decoder can reuse
     * them (CPU runner mirrors this — encoder + decoder must agree on the
     * same warp matrix or the decoder cam_int / rays_xyz disagree with the
     * actual image fed to DINOv3). */
    int      self_pp_set;
    float    self_center[2];
    float    self_scale[2];
    float    self_warp[6];
    float    self_cam_int[9];

    f32_2d   encoder_tokens;
    float   *mhr_params;   int mhr_params_n;
    float    cam_t[3];
    float    focal_px;
    float   *vertices;     int n_vertices;
    int32_t *faces;        int n_faces;
    float   *keypoints_3d; int n_kp_3d;
    float   *keypoints_2d; int n_kp_2d;
};

/* ===================== safetensors helpers ===================== */

static int sb_find(const st_context *st, const char *s) {
    char k[256]; snprintf(k, sizeof(k), "backbone.encoder.%s", s);
    return safetensors_find(st, k);
}

/* ViT-H prefix is `backbone.` (no `encoder.` segment). */
static int sb_find_vith(const st_context *st, const char *s) {
    char k[256]; snprintf(k, sizeof(k), "backbone.%s", s);
    return safetensors_find(st, k);
}

static void *sb_upload_f32(const st_context *st, const char *s, size_t expect_n) {
    int i = sb_find(st, s);
    if (i < 0) { fprintf(stderr, "sam3d_body: missing %s\n", s); return NULL; }
    if (strcmp(safetensors_dtype(st, i), "F32") != 0) {
        fprintf(stderr, "sam3d_body: %s not F32 (%s)\n", s, safetensors_dtype(st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes(st, i);
    if (expect_n && nb / 4 != expect_n) {
        fprintf(stderr, "sam3d_body: %s size mismatch: got %zu f32, expected %zu\n",
                s, nb / 4, expect_n);
        return NULL;
    }
    return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
}

static void *sb_upload_f16(const st_context *st, const char *s, size_t expect_n) {
    int i = sb_find(st, s);
    if (i < 0) { fprintf(stderr, "sam3d_body: missing %s\n", s); return NULL; }
    const char *dt = safetensors_dtype(st, i);
    size_t nb = safetensors_nbytes(st, i);
    size_t n;
    if (!strcmp(dt, "F16")) {
        n = nb / 2;
        if (expect_n && n != expect_n) {
            fprintf(stderr, "sam3d_body: %s f16 size mismatch: %zu vs %zu\n",
                    s, n, expect_n);
            return NULL;
        }
        return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
    }
    if (!strcmp(dt, "F32")) {
        n = nb / 4;
        if (expect_n && n != expect_n) {
            fprintf(stderr, "sam3d_body: %s f32→f16 size mismatch: %zu vs %zu\n",
                    s, n, expect_n);
            return NULL;
        }
        const float *src = (const float *)safetensors_data((st_context *)st, i);
        uint16_t *t = (uint16_t *)malloc(n * 2);
        for (size_t k = 0; k < n; k++) t[k] = hip_f32_to_f16(src[k]);
        void *d = hip_upload_raw(t, n * 2);
        free(t);
        return d;
    }
    fprintf(stderr, "sam3d_body: %s unsupported dtype %s\n", s, dt);
    return NULL;
}

/* `backbone.<name>` variants for the ViT-H backbone. */
static void *sb_upload_vith_f32(const st_context *st, const char *s,
                                size_t expect_n) {
    int i = sb_find_vith(st, s);
    if (i < 0) { fprintf(stderr, "sam3d_body_vith: missing %s\n", s); return NULL; }
    if (strcmp(safetensors_dtype(st, i), "F32") != 0) {
        fprintf(stderr, "sam3d_body_vith: %s not F32 (%s)\n",
                s, safetensors_dtype(st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes(st, i);
    if (expect_n && nb / 4 != expect_n) {
        fprintf(stderr, "sam3d_body_vith: %s size mismatch: got %zu f32, expected %zu\n",
                s, nb / 4, expect_n);
        return NULL;
    }
    return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
}

static void *sb_upload_vith_f16(const st_context *st, const char *s,
                                size_t expect_n) {
    int i = sb_find_vith(st, s);
    if (i < 0) { fprintf(stderr, "sam3d_body_vith: missing %s\n", s); return NULL; }
    const char *dt = safetensors_dtype(st, i);
    size_t nb = safetensors_nbytes(st, i);
    size_t n;
    if (!strcmp(dt, "F16")) {
        n = nb / 2;
        if (expect_n && n != expect_n) {
            fprintf(stderr, "sam3d_body_vith: %s f16 size mismatch: %zu vs %zu\n",
                    s, n, expect_n);
            return NULL;
        }
        return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
    }
    if (!strcmp(dt, "F32")) {
        n = nb / 4;
        if (expect_n && n != expect_n) {
            fprintf(stderr, "sam3d_body_vith: %s f32→f16 size mismatch: %zu vs %zu\n",
                    s, n, expect_n);
            return NULL;
        }
        const float *src = (const float *)safetensors_data((st_context *)st, i);
        uint16_t *t = (uint16_t *)malloc(n * 2);
        for (size_t k = 0; k < n; k++) t[k] = hip_f32_to_f16(src[k]);
        void *d = hip_upload_raw(t, n * 2);
        free(t);
        return d;
    }
    fprintf(stderr, "sam3d_body_vith: %s unsupported dtype %s\n", s, dt);
    return NULL;
}

static int sb_load_block_vith(cuda_sam3d_body_ctx *c, int bi) {
    sb_block_vith *b = &c->vith_blk[bi];
    char k[160];
    #define K(suf) (snprintf(k, sizeof(k), "blocks.%d." suf, bi), k)
    b->norm1_w = sb_upload_vith_f32(c->st_enc, K("norm1.weight"), SB_VITH_DIM);
    b->norm1_b = sb_upload_vith_f32(c->st_enc, K("norm1.bias"),   SB_VITH_DIM);
    b->norm2_w = sb_upload_vith_f32(c->st_enc, K("norm2.weight"), SB_VITH_DIM);
    b->norm2_b = sb_upload_vith_f32(c->st_enc, K("norm2.bias"),   SB_VITH_DIM);
    b->qkv_w   = sb_upload_vith_f16(c->st_enc, K("attn.qkv.weight"),
                                    (size_t)3 * SB_VITH_DIM * SB_VITH_DIM);
    b->qkv_b   = sb_upload_vith_f32(c->st_enc, K("attn.qkv.bias"),
                                    (size_t)3 * SB_VITH_DIM);
    b->proj_w  = sb_upload_vith_f16(c->st_enc, K("attn.proj.weight"),
                                    (size_t)SB_VITH_DIM * SB_VITH_DIM);
    b->proj_b  = sb_upload_vith_f32(c->st_enc, K("attn.proj.bias"), SB_VITH_DIM);
    b->fc1_w   = sb_upload_vith_f16(c->st_enc, K("mlp.fc1.weight"),
                                    (size_t)SB_VITH_FFN * SB_VITH_DIM);
    b->fc1_b   = sb_upload_vith_f32(c->st_enc, K("mlp.fc1.bias"), SB_VITH_FFN);
    b->fc2_w   = sb_upload_vith_f16(c->st_enc, K("mlp.fc2.weight"),
                                    (size_t)SB_VITH_DIM * SB_VITH_FFN);
    b->fc2_b   = sb_upload_vith_f32(c->st_enc, K("mlp.fc2.bias"), SB_VITH_DIM);
    #undef K
    if (!b->norm1_w || !b->norm1_b || !b->norm2_w || !b->norm2_b ||
        !b->qkv_w || !b->qkv_b || !b->proj_w || !b->proj_b ||
        !b->fc1_w || !b->fc1_b || !b->fc2_w || !b->fc2_b)
        return -1;
    return 0;
}

static int sb_load_block(cuda_sam3d_body_ctx *c, int bi) {
    sb_block *b = &c->blk[bi];
    char k[160];
    #define K(suf) (snprintf(k, sizeof(k), "blocks.%d." suf, bi), k)
    b->norm1_w = sb_upload_f32(c->st_enc, K("norm1.weight"), SB_DIM);
    b->norm1_b = sb_upload_f32(c->st_enc, K("norm1.bias"),   SB_DIM);
    b->norm2_w = sb_upload_f32(c->st_enc, K("norm2.weight"), SB_DIM);
    b->norm2_b = sb_upload_f32(c->st_enc, K("norm2.bias"),   SB_DIM);
    b->qkv_w   = sb_upload_f16(c->st_enc, K("attn.qkv.weight"), (size_t)3 * SB_DIM * SB_DIM);
    b->qkv_b   = sb_upload_f32(c->st_enc, K("attn.qkv.bias"),   (size_t)3 * SB_DIM);
    b->proj_w  = sb_upload_f16(c->st_enc, K("attn.proj.weight"), (size_t)SB_DIM * SB_DIM);
    b->proj_b  = sb_upload_f32(c->st_enc, K("attn.proj.bias"),   SB_DIM);
    b->ls1     = sb_upload_f32(c->st_enc, K("ls1.gamma"), SB_DIM);
    b->ls2     = sb_upload_f32(c->st_enc, K("ls2.gamma"), SB_DIM);
    b->w1_w    = sb_upload_f16(c->st_enc, K("mlp.w1.weight"), (size_t)SB_FFN * SB_DIM);
    b->w1_b    = sb_upload_f32(c->st_enc, K("mlp.w1.bias"),   SB_FFN);
    b->w2_w    = sb_upload_f16(c->st_enc, K("mlp.w2.weight"), (size_t)SB_FFN * SB_DIM);
    b->w2_b    = sb_upload_f32(c->st_enc, K("mlp.w2.bias"),   SB_FFN);
    b->w3_w    = sb_upload_f16(c->st_enc, K("mlp.w3.weight"), (size_t)SB_DIM * SB_FFN);
    b->w3_b    = sb_upload_f32(c->st_enc, K("mlp.w3.bias"),   SB_DIM);
    #undef K
    if (!b->norm1_w || !b->norm1_b || !b->norm2_w || !b->norm2_b ||
        !b->qkv_w || !b->qkv_b || !b->proj_w || !b->proj_b ||
        !b->ls1 || !b->ls2 ||
        !b->w1_w || !b->w1_b || !b->w2_w || !b->w2_b || !b->w3_w || !b->w3_b)
        return -1;
    return 0;
}

/* ---- decoder/MHR-head loaders (Step 5a) ---- */

