lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
/* Look up `name` in `st`, verify dtype is F32, upload to device. */
/* Return host pointer into the mmapped safetensors blob (no copy, no
 * upload). Caller must keep the st_context alive. */
static const float *sb_host_st_f32(const st_context *st, const char *name,
                                   size_t expect_n) {
    int i = safetensors_find((st_context *)st, name);
    if (i < 0) {
        fprintf(stderr, "sam3d_body: missing %s\n", name);
        return NULL;
    }
    if (strcmp(safetensors_dtype((st_context *)st, i), "F32") != 0) {
        fprintf(stderr, "sam3d_body: %s not F32 (got %s)\n",
                name, safetensors_dtype((st_context *)st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes((st_context *)st, i);
    if (expect_n && nb / 4 != expect_n) {
        fprintf(stderr, "sam3d_body: %s size %zu f32 vs %zu expected\n",
                name, nb / 4, expect_n);
        return NULL;
    }
    return (const float *)safetensors_data((st_context *)st, i);
}

static void *sb_upload_st_f32(const st_context *st, const char *name,
                              size_t expect_n) {
    int i = safetensors_find((st_context *)st, name);
    if (i < 0) {
        fprintf(stderr, "sam3d_body: missing %s\n", name);
        return NULL;
    }
    if (strcmp(safetensors_dtype((st_context *)st, i), "F32") != 0) {
        fprintf(stderr, "sam3d_body: %s not F32 (got %s)\n",
                name, safetensors_dtype((st_context *)st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes((st_context *)st, i);
    if (expect_n && nb / 4 != expect_n) {
        fprintf(stderr, "sam3d_body: %s size %zu f32 vs %zu expected\n",
                name, nb / 4, expect_n);
        return NULL;
    }
    return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
}

static void *sb_upload_st_i64(const st_context *st, const char *name,
                              size_t expect_n) {
    int i = safetensors_find((st_context *)st, name);
    if (i < 0) {
        fprintf(stderr, "sam3d_body: missing %s\n", name);
        return NULL;
    }
    if (strcmp(safetensors_dtype((st_context *)st, i), "I64") != 0) {
        fprintf(stderr, "sam3d_body: %s not I64 (got %s)\n",
                name, safetensors_dtype((st_context *)st, i));
        return NULL;
    }
    size_t nb = safetensors_nbytes((st_context *)st, i);
    if (expect_n && nb / 8 != expect_n) {
        fprintf(stderr, "sam3d_body: %s size %zu i64 vs %zu expected\n",
                name, nb / 8, expect_n);
        return NULL;
    }
    return hip_upload_raw(safetensors_data((st_context *)st, i), nb);
}

/* Per-layer load. Returns 0 on success, -1 on failure. */
static int sb_load_dec_layer(cuda_sam3d_body_ctx *c, int li) {
    sb_dec_layer_w *L = &c->dec.layers[li];
    char p[192];
    const st_context *dec = c->st_dec;

    #define LD_LN(prefix, fld_w, fld_b)                                 \
        do {                                                            \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".weight", li);             \
            L->fld_w = sb_upload_st_f32(dec, p, SB_DEC_DIM);            \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".bias", li);               \
            L->fld_b = sb_upload_st_f32(dec, p, SB_DEC_DIM);            \
            if (!L->fld_w || !L->fld_b) return -1;                      \
        } while (0)

    /* For LNs that normalize the (1280,) image stream. */
    #define LD_LN_KV(prefix, fld_w, fld_b)                              \
        do {                                                            \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".weight", li);             \
            L->fld_w = sb_upload_st_f32(dec, p, SB_DEC_KV_DIM);         \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".bias", li);               \
            L->fld_b = sb_upload_st_f32(dec, p, SB_DEC_KV_DIM);         \
            if (!L->fld_w || !L->fld_b) return -1;                      \
        } while (0)

    #define LD_PROJ(prefix, fld_w, fld_b, w_n, b_n)                     \
        do {                                                            \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".weight", li);             \
            L->fld_w = sb_upload_st_f32(dec, p, w_n);                   \
            snprintf(p, sizeof(p),                                      \
                "decoder.layers.%d." prefix ".bias", li);               \
            L->fld_b = sb_upload_st_f32(dec, p, b_n);                   \
            if (!L->fld_w || !L->fld_b) return -1;                      \
        } while (0)

    LD_LN("ln1",     ln1_w,     ln1_b);
    LD_LN("ln_pe_1", ln_pe_1_w, ln_pe_1_b);
    LD_LN("ln2_1",   ln2_1_w,   ln2_1_b);
    LD_LN_KV("ln2_2",   ln2_2_w,   ln2_2_b);
    LD_LN_KV("ln_pe_2", ln_pe_2_w, ln_pe_2_b);
    LD_LN("ln3",     ln3_w,     ln3_b);

    /* Self-attn: q/k/v 1024→512, proj 512→1024. */
    LD_PROJ("self_attn.q_proj", sa_q_w, sa_q_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("self_attn.k_proj", sa_k_w, sa_k_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("self_attn.v_proj", sa_v_w, sa_v_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("self_attn.proj", sa_proj_w, sa_proj_b,
            (size_t)SB_DEC_DIM * SB_DEC_PROJ_DIM, SB_DEC_DIM);

    /* Cross-attn: q 1024→512, k/v 1280→512, proj 512→1024. */
    LD_PROJ("cross_attn.q_proj", ca_q_w, ca_q_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("cross_attn.k_proj", ca_k_w, ca_k_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_KV_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("cross_attn.v_proj", ca_v_w, ca_v_b,
            (size_t)SB_DEC_PROJ_DIM * SB_DEC_KV_DIM, SB_DEC_PROJ_DIM);
    LD_PROJ("cross_attn.proj", ca_proj_w, ca_proj_b,
            (size_t)SB_DEC_DIM * SB_DEC_PROJ_DIM, SB_DEC_DIM);

