lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
    /* FFN: 1024→1024→1024 (ReLU between, per CPU port). */
    LD_PROJ("ffn.layers.0.0", ffn0_w, ffn0_b,
            (size_t)SB_DEC_FFN * SB_DEC_DIM, SB_DEC_FFN);
    LD_PROJ("ffn.layers.1", ffn1_w, ffn1_b,
            (size_t)SB_DEC_DIM * SB_DEC_FFN, SB_DEC_DIM);

    #undef LD_LN
    #undef LD_LN_KV
    #undef LD_PROJ
    return 0;
}

/* Resolve a per-variant safetensors path. Tries
 *   <dir>/sam3d_body_<variant>_<bucket>.safetensors
 * first, then falls back to the legacy unprefixed alias
 *   <dir>/sam3d_body_<bucket>.safetensors
 * (kept for the dinov3 default — matches the slicer in
 * cpu/sam3d_body/convert_ckpt.py). Returns NULL only if neither exists. */
static char *sb_resolve_variant_path(const char *dir, const char *bucket,
                                     cuda_sam3d_body_backbone_t backbone,
                                     char *buf, size_t buflen)
{
    const char *tag = (backbone == CUDA_SAM3D_BODY_BACKBONE_VITH) ? "vith"
                                                                  : "dinov3";
    snprintf(buf, buflen, "%s/sam3d_body_%s_%s.safetensors", dir, tag, bucket);
    FILE *f = fopen(buf, "rb");
    if (f) { fclose(f); return buf; }
    snprintf(buf, buflen, "%s/sam3d_body_%s.safetensors", dir, bucket);
    f = fopen(buf, "rb");
    if (f) { fclose(f); return buf; }
    return NULL;
}

static int sb_load_decoder(cuda_sam3d_body_ctx *c) {
    if (c->dec.loaded) return 0;
    char path[1024];
    if (!sb_resolve_variant_path(c->cfg.safetensors_dir, "decoder",
                                 c->cfg.backbone, path, sizeof(path))) {
        fprintf(stderr, "sam3d_body: cannot find decoder safetensors in %s "
                        "(tried sam3d_body_{vith,dinov3}_decoder + legacy)\n",
                c->cfg.safetensors_dir);
        return -1;
    }
    c->st_dec = safetensors_open(path);
    if (!c->st_dec) {
        fprintf(stderr, "sam3d_body: cannot open %s\n", path);
        return -1;
    }
    if (!sb_resolve_variant_path(c->cfg.safetensors_dir, "mhr_head",
                                 c->cfg.backbone, path, sizeof(path))) {
        fprintf(stderr, "sam3d_body: cannot find mhr_head safetensors in %s\n",
                c->cfg.safetensors_dir);
        return -1;
    }
    c->st_mhr = safetensors_open(path);
    if (!c->st_mhr) {
        fprintf(stderr, "sam3d_body: cannot open %s\n", path);
        return -1;
    }

    sb_dec_w *D = &c->dec;
    const st_context *dec = c->st_dec;
    const st_context *mhr = c->st_mhr;

    /* ray_cond_emb (conv has bias=False, omit). */
    D->ray_cond_conv_w = sb_upload_st_f32(dec, "ray_cond_emb.conv.weight",
                                          (size_t)SB_DEC_KV_DIM * 1379);
    D->ray_cond_norm_w = sb_upload_st_f32(dec, "ray_cond_emb.norm.weight",
                                          SB_DEC_KV_DIM);
    D->ray_cond_norm_b = sb_upload_st_f32(dec, "ray_cond_emb.norm.bias",
                                          SB_DEC_KV_DIM);

    /* Token construction. */
    D->init_to_token_w = sb_upload_st_f32(dec, "init_to_token_mhr.weight",
                                          (size_t)SB_DEC_DIM *
                                          (SB_DEC_NPOSE + SB_DEC_NCAM + SB_DEC_COND));
    D->init_to_token_b = sb_upload_st_f32(dec, "init_to_token_mhr.bias",
                                          SB_DEC_DIM);
    D->prev_to_token_w = sb_upload_st_f32(dec, "prev_to_token_mhr.weight",
                                          (size_t)SB_DEC_DIM *
                                          (SB_DEC_NPOSE + SB_DEC_NCAM));
    D->prev_to_token_b = sb_upload_st_f32(dec, "prev_to_token_mhr.bias",
                                          SB_DEC_DIM);
    D->prompt_to_token_w = sb_upload_st_f32(dec, "prompt_to_token.weight",
                                            (size_t)SB_DEC_DIM * SB_DEC_KV_DIM);
    D->prompt_to_token_b = sb_upload_st_f32(dec, "prompt_to_token.bias",
                                            SB_DEC_DIM);
    D->keypoint_embedding   = sb_upload_st_f32(dec, "keypoint_embedding.weight",
                                               (size_t)SB_DEC_KP * SB_DEC_DIM);
    D->keypoint3d_embedding = sb_upload_st_f32(dec, "keypoint3d_embedding.weight",
                                               (size_t)SB_DEC_KP * SB_DEC_DIM);
    D->hand_box_embedding   = sb_upload_st_f32(dec, "hand_box_embedding.weight",
                                               (size_t)SB_DEC_HAND_TOK * SB_DEC_DIM);
    D->prompt_pe_gauss = sb_upload_st_f32(dec,
        "prompt_encoder.pe_layer.positional_encoding_gaussian_matrix",
        2 * 640);
    D->invalid_point_embed = sb_upload_st_f32(dec,
        "prompt_encoder.invalid_point_embed.weight",
        (size_t)SB_DEC_KV_DIM);
    D->no_mask_embed_h = sb_host_st_f32(dec,
        "prompt_encoder.no_mask_embed.weight",
        (size_t)SB_DEC_KV_DIM);

    /* Keypoint-token update path. */
    D->kp_feat_linear_w = sb_upload_st_f32(dec, "keypoint_feat_linear.weight",
                                           (size_t)SB_DEC_DIM * SB_DEC_KV_DIM);
    D->kp_feat_linear_b = sb_upload_st_f32(dec, "keypoint_feat_linear.bias",
                                           SB_DEC_DIM);
    D->kp_posemb_l0_w = sb_upload_st_f32(dec,
        "keypoint_posemb_linear.layers.0.0.weight", (size_t)SB_DEC_DIM * 2);
    D->kp_posemb_l0_b = sb_upload_st_f32(dec,
        "keypoint_posemb_linear.layers.0.0.bias",   SB_DEC_DIM);
    D->kp_posemb_l1_w = sb_upload_st_f32(dec,
        "keypoint_posemb_linear.layers.1.weight",   (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->kp_posemb_l1_b = sb_upload_st_f32(dec,
        "keypoint_posemb_linear.layers.1.bias",     SB_DEC_DIM);
    D->kp3d_posemb_l0_w = sb_upload_st_f32(dec,
        "keypoint3d_posemb_linear.layers.0.0.weight", (size_t)SB_DEC_DIM * 3);
    D->kp3d_posemb_l0_b = sb_upload_st_f32(dec,
        "keypoint3d_posemb_linear.layers.0.0.bias",   SB_DEC_DIM);
    D->kp3d_posemb_l1_w = sb_upload_st_f32(dec,
        "keypoint3d_posemb_linear.layers.1.weight",   (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->kp3d_posemb_l1_b = sb_upload_st_f32(dec,
        "keypoint3d_posemb_linear.layers.1.bias",     SB_DEC_DIM);

    if (!D->ray_cond_conv_w || !D->ray_cond_norm_w || !D->ray_cond_norm_b ||
        !D->init_to_token_w || !D->init_to_token_b ||
        !D->prev_to_token_w || !D->prev_to_token_b ||
        !D->prompt_to_token_w || !D->prompt_to_token_b ||
        !D->keypoint_embedding || !D->keypoint3d_embedding ||
        !D->hand_box_embedding ||
        !D->prompt_pe_gauss || !D->invalid_point_embed ||
        !D->no_mask_embed_h ||
        !D->kp_feat_linear_w || !D->kp_feat_linear_b ||
        !D->kp_posemb_l0_w || !D->kp_posemb_l0_b ||
        !D->kp_posemb_l1_w || !D->kp_posemb_l1_b ||
        !D->kp3d_posemb_l0_w || !D->kp3d_posemb_l0_b ||
        !D->kp3d_posemb_l1_w || !D->kp3d_posemb_l1_b)
        return -1;

    for (int li = 0; li < SB_DEC_LAYERS; li++) {
        if (sb_load_dec_layer(c, li) < 0) {
            fprintf(stderr, "sam3d_body: decoder layer %d load failed\n", li);
            return -1;
        }
    }

    D->norm_final_w = sb_upload_st_f32(dec, "decoder.norm_final.weight",
                                       SB_DEC_DIM);
    D->norm_final_b = sb_upload_st_f32(dec, "decoder.norm_final.bias",
                                       SB_DEC_DIM);
    if (!D->norm_final_w || !D->norm_final_b) return -1;

    /* MHR head regression (mhr_head safetensors). */
    D->head_pose_l0_w   = sb_upload_st_f32(mhr,
        "head_pose.proj.layers.0.0.weight", (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->head_pose_l0_b   = sb_upload_st_f32(mhr,
        "head_pose.proj.layers.0.0.bias",   SB_DEC_DIM);
    D->head_pose_l1_w   = sb_upload_st_f32(mhr,
        "head_pose.proj.layers.1.weight",   (size_t)SB_DEC_NPOSE * SB_DEC_DIM);
    D->head_pose_l1_b   = sb_upload_st_f32(mhr,
        "head_pose.proj.layers.1.bias",     SB_DEC_NPOSE);
    D->head_camera_l0_w = sb_upload_st_f32(mhr,
        "head_camera.proj.layers.0.0.weight", (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->head_camera_l0_b = sb_upload_st_f32(mhr,
        "head_camera.proj.layers.0.0.bias",   SB_DEC_DIM);
    D->head_camera_l1_w = sb_upload_st_f32(mhr,
        "head_camera.proj.layers.1.weight",   (size_t)SB_DEC_NCAM * SB_DEC_DIM);
    D->head_camera_l1_b = sb_upload_st_f32(mhr,
        "head_camera.proj.layers.1.bias",     SB_DEC_NCAM);
    D->init_pose   = sb_upload_st_f32(mhr, "init_pose.weight",   SB_DEC_NPOSE);
    D->init_camera = sb_upload_st_f32(mhr, "init_camera.weight", SB_DEC_NCAM);

    if (!D->head_pose_l0_w || !D->head_pose_l0_b ||
        !D->head_pose_l1_w || !D->head_pose_l1_b ||
        !D->head_camera_l0_w || !D->head_camera_l0_b ||
        !D->head_camera_l1_w || !D->head_camera_l1_b ||
        !D->init_pose || !D->init_camera)
        return -1;

