lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
    /* Host (mmap-backed) views of the same tensors for the CPU
     * norm_and_heads tail. */
    D->norm_final_w_h = sb_host_st_f32(dec, "decoder.norm_final.weight",
                                       SB_DEC_DIM);
    D->norm_final_b_h = sb_host_st_f32(dec, "decoder.norm_final.bias",
                                       SB_DEC_DIM);
    D->head_pose_l0_w_h = sb_host_st_f32(mhr,
        "head_pose.proj.layers.0.0.weight", (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->head_pose_l0_b_h = sb_host_st_f32(mhr,
        "head_pose.proj.layers.0.0.bias",   SB_DEC_DIM);
    D->head_pose_l1_w_h = sb_host_st_f32(mhr,
        "head_pose.proj.layers.1.weight",   (size_t)SB_DEC_NPOSE * SB_DEC_DIM);
    D->head_pose_l1_b_h = sb_host_st_f32(mhr,
        "head_pose.proj.layers.1.bias",     SB_DEC_NPOSE);
    D->head_camera_l0_w_h = sb_host_st_f32(mhr,
        "head_camera.proj.layers.0.0.weight", (size_t)SB_DEC_DIM * SB_DEC_DIM);
    D->head_camera_l0_b_h = sb_host_st_f32(mhr,
        "head_camera.proj.layers.0.0.bias",   SB_DEC_DIM);
    D->head_camera_l1_w_h = sb_host_st_f32(mhr,
        "head_camera.proj.layers.1.weight",   (size_t)SB_DEC_NCAM * SB_DEC_DIM);
    D->head_camera_l1_b_h = sb_host_st_f32(mhr,
        "head_camera.proj.layers.1.bias",     SB_DEC_NCAM);
    if (!D->norm_final_w_h || !D->norm_final_b_h ||
        !D->head_pose_l0_w_h || !D->head_pose_l0_b_h ||
        !D->head_pose_l1_w_h || !D->head_pose_l1_b_h ||
        !D->head_camera_l0_w_h || !D->head_camera_l0_b_h ||
        !D->head_camera_l1_w_h || !D->head_camera_l1_b_h)
        return -1;

    /* MHR-head decode tables. */
    D->scale_mean       = sb_upload_st_f32(mhr, "head_pose.scale_mean",      68);
    D->scale_comps      = sb_upload_st_f32(mhr, "head_pose.scale_comps",     28 * 68);
    D->hand_pose_mean   = sb_upload_st_f32(mhr, "head_pose.hand_pose_mean",  54);
    D->hand_pose_comps  = sb_upload_st_f32(mhr, "head_pose.hand_pose_comps", 54 * 54);
    D->hand_idx_left    = sb_upload_st_i64(mhr, "head_pose.hand_joint_idxs_left",  27);
    D->hand_idx_right   = sb_upload_st_i64(mhr, "head_pose.hand_joint_idxs_right", 27);
    D->keypoint_mapping = sb_upload_st_f32(mhr, "head_pose.keypoint_mapping",
                                           (size_t)308 * 18566);
    D->local_to_world_wrist = sb_upload_st_f32(mhr,
        "head_pose.local_to_world_wrist", 3 * 3);
    D->right_wrist_coords   = sb_upload_st_f32(mhr,
        "head_pose.right_wrist_coords",   3);
    D->root_coords          = sb_upload_st_f32(mhr,
        "head_pose.root_coords",          3);
    D->nonhand_param_idxs   = sb_upload_st_i64(mhr,
        "head_pose.nonhand_param_idxs",   145);

    if (!D->scale_mean || !D->scale_comps ||
        !D->hand_pose_mean || !D->hand_pose_comps ||
        !D->hand_idx_left || !D->hand_idx_right ||
        !D->keypoint_mapping || !D->local_to_world_wrist ||
        !D->right_wrist_coords || !D->root_coords ||
        !D->nonhand_param_idxs)
        return -1;

    /* faces stays on host — used by OBJ writer + ctx->faces. */
    {
        int fi = safetensors_find((st_context *)mhr, "head_pose.faces");
        if (fi < 0 ||
            strcmp(safetensors_dtype((st_context *)mhr, fi), "I64") != 0) {
            fprintf(stderr, "sam3d_body: head_pose.faces missing or not I64\n");
            return -1;
        }
        size_t nb = safetensors_nbytes((st_context *)mhr, fi);
        size_t nf = nb / (sizeof(int64_t) * 3);
        D->host_faces_i64 = (int64_t *)malloc(nb);
        if (!D->host_faces_i64) return -1;
        memcpy(D->host_faces_i64,
               safetensors_data((st_context *)mhr, fi), nb);
        D->n_faces = (int)nf;
    }

    D->loaded = 1;
    if (c->verbose >= 1)
        fprintf(stderr, "sam3d_body: decoder + MHR-head loaded "
                        "(6 layers, 145-token body branch, %d faces)\n",
                D->n_faces);
    return 0;
}

static int sb_compile(cuda_sam3d_body_ctx *c) {
    size_t la = strlen(cuda_kernels_common_src);
    size_t lb = strlen(cuda_sam3d_body_kernels_src);
    char *src = (char *)malloc(la + lb + 1);
    if (!src) return -1;
    memcpy(src, cuda_kernels_common_src, la);
    memcpy(src + la, cuda_sam3d_body_kernels_src, lb + 1);
    int rc = hip_compile_kernels(&c->mod, c->device_id, src,
                                 "sam3d_body_kernels", c->verbose, "sam3d_body");
    free(src);
    if (rc < 0) return -1;
    c->sm = rc;
    #define BIND(field, name) do { \
        if (hipModuleGetFunction(&c->field, c->mod, name) != hipSuccess) { \
            fprintf(stderr, "sam3d_body: missing kernel %s\n", name); \
            return -1; \
        } \
    } while (0)
    BIND(fn_sentinel, "sam3d_body_sentinel");
    BIND(fn_resize,   "resize_normalize");
    BIND(fn_patch,    "patch_embed_sam3d");
    BIND(fn_prepend,  "prepend_special_tokens");
    BIND(fn_bf16_round,     "bf16_round_inplace_f32");
    BIND(fn_ln,             "layernorm_f32");
    BIND(fn_gemm_tiled,     "gemm_tiled_f16_f32");
    BIND(fn_rope_qk,        "rope_apply_qk_rh_sam3d");
    BIND(fn_kv_tx,          "kv_transpose");
    BIND(fn_fa,             "flash_attn_tiled_f32");
    BIND(fn_silu_mul,       "silu_mul_f32");
    BIND(fn_layerscale_add, "layerscale_add_f32");
    BIND(fn_ray_cond_fourier, "ray_cond_fourier_chw_f32");
    BIND(fn_conv1x1_chw,      "conv1x1_chw_f32");
    BIND(fn_ln_chw,           "layernorm_chw_f32");
    BIND(fn_linear_bias,      "linear_f32_bias");
    BIND(fn_gemm_f32,         "gemm_f32_bias");
    BIND(fn_add_two,          "add_two_f32");
    BIND(fn_add_inplace,      "add_inplace_f32");
    BIND(fn_gelu_inplace,     "gelu_inplace_f32");
    BIND(fn_sdpa,             "sdpa_f32");
    BIND(fn_relu_inplace,     "relu_inplace_f32");
    BIND(fn_grid_sample,      "grid_sample_chw_f32");
    BIND(fn_kp_pelvis_norm,   "kp_pelvis_norm_f32");
    BIND(fn_augment_overwrite_mask, "augment_overwrite_with_mask_f32");
    BIND(fn_patch_pad2,     "patch_embed_pad2_f32");
    BIND(fn_pos_embed_vith, "pos_embed_add_vith_f32");
    BIND(fn_qkv_split,      "qkv_split_f32");
    BIND(fn_mhr_blend,      "mhr_blend_combine_f32");
    BIND(fn_mhr_lbs,        "mhr_lbs_skin_f32");
    #undef BIND
    return 0;
}

static int sb_launch(hipFunction_t fn, unsigned gx, unsigned gy, unsigned gz,
                     unsigned bx, unsigned by, unsigned bz,
                     unsigned shmem, void *p, size_t pb) {
    void *cfg[] = { CU_LAUNCH_PARAM_BUFFER_POINTER, p,
                    CU_LAUNCH_PARAM_BUFFER_SIZE,    &pb,
                    CU_LAUNCH_PARAM_END };
    hipError_t e = hipModuleLaunchKernel(fn, gx, gy, gz, bx, by, bz, shmem, 0, NULL, cfg);
    if (e != hipSuccess) {
        fprintf(stderr, "sam3d_body: launch err=%d grid=%ux%ux%u block=%ux%ux%u\n",
                (int)e, gx, gy, gz, bx, by, bz);
        return -1;
    }
    return 0;
}

static int sb_precision_is_bf16(const cuda_sam3d_body_ctx *ctx)
{
    const char *p = ctx && ctx->cfg.precision ? ctx->cfg.precision : NULL;
    return p && p[0] && !strcmp(p, "bf16");
}

static int sb_precision_is_supported(const char *p)
{
    return !p || !p[0] || !strcmp(p, "bf16") || !strcmp(p, "fp16");
}

static int sb_bf16_round(cuda_sam3d_body_ctx *ctx, void *x, int n)
{
    if (!sb_precision_is_bf16(ctx) || !x || n <= 0) return 0;
    struct __attribute__((packed)) {
        void *x; int n;
    } p = { x, n };
    return sb_launch(ctx->fn_bf16_round, (unsigned)((n + 255) / 256), 1, 1,
                     256, 1, 1, 0, &p, sizeof(p));
}

/* ===================== public API ===================== */

cuda_sam3d_body_ctx *cuda_sam3d_body_create(const cuda_sam3d_body_config *cfg)
{
    if (!cfg || !cfg->safetensors_dir) return NULL;
    if (!sb_precision_is_supported(cfg->precision)) {
        fprintf(stderr, "sam3d_body: unsupported precision '%s' (expected fp16 or bf16)\n",
                cfg->precision);
        return NULL;
    }

