lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
    cuda_sam3d_body_ctx *c = (cuda_sam3d_body_ctx *)calloc(1, sizeof(*c));
    if (!c) return NULL;
    c->cfg = *cfg;
    c->device_id = cfg->device_ordinal;
    c->verbose = cfg->verbose;
    if (c->cfg.image_size <= 0) c->cfg.image_size = SB_IMG;
    if (c->cfg.image_height <= 0) c->cfg.image_height = c->cfg.image_size;
    if (c->cfg.image_width  <= 0) c->cfg.image_width  = c->cfg.image_size;
    if (c->cfg.backbone != CUDA_SAM3D_BODY_BACKBONE_VITH) {
        if (c->cfg.image_height <= 0 || c->cfg.image_width <= 0 ||
            (c->cfg.image_height % SB_PATCH) != 0 ||
            (c->cfg.image_width  % SB_PATCH) != 0) {
            fprintf(stderr,
                    "sam3d_body: DINOv3 image shape must be positive and "
                    "divisible by patch size %d, got %dx%d\n",
                    SB_PATCH, c->cfg.image_height, c->cfg.image_width);
            free(c); return NULL;
        }
    }

    if (rocewInit(ROCEW_INIT_HIP | ROCEW_INIT_HIPRTC) != ROCEW_SUCCESS) {
        fprintf(stderr, "sam3d_body: cuew init failed\n");
        free(c); return NULL;
    }
    hipError_t set_device_err = hipSetDevice(c->device_id);
    if (set_device_err != hipSuccess) {
        const char *err_s = NULL;
        hipGetErrorString(set_device_err, &err_s);
        fprintf(stderr, "sam3d_body: hipSetDevice(%d) failed: %s (%d)\n",
                c->device_id, err_s ? err_s : "unknown",
                (int)set_device_err);
        free(c); return NULL;
    }
    if (sb_compile(c) < 0) {
        fprintf(stderr, "sam3d_body: kernel compile failed\n");
        free(c); return NULL;
    }

    char path[512];

    if (c->cfg.backbone == CUDA_SAM3D_BODY_BACKBONE_VITH) {
        snprintf(path, sizeof(path), "%s/sam3d_body_vith.safetensors",
                 cfg->safetensors_dir);
        c->st_enc = safetensors_open(path);
        if (!c->st_enc) {
            fprintf(stderr, "sam3d_body_vith: cannot open %s\n", path);
            cuda_sam3d_body_destroy(c); return NULL;
        }
        if (c->verbose >= 1)
            fprintf(stderr, "sam3d_body_vith: opened %s\n", path);

        c->w_patch_w = sb_upload_vith_f32(c->st_enc, "patch_embed.proj.weight",
                                          (size_t)SB_VITH_DIM * 3 * SB_VITH_PATCH * SB_VITH_PATCH);
        c->w_patch_b = sb_upload_vith_f32(c->st_enc, "patch_embed.proj.bias",
                                          SB_VITH_DIM);
        c->w_vith_pos_embed = sb_upload_vith_f32(c->st_enc, "pos_embed",
                                                 (size_t)(SB_VITH_N_PATCH + 1) * SB_VITH_DIM);
        c->w_norm_w = sb_upload_vith_f32(c->st_enc, "last_norm.weight",
                                         SB_VITH_DIM);
        c->w_norm_b = sb_upload_vith_f32(c->st_enc, "last_norm.bias",
                                         SB_VITH_DIM);
        if (!c->w_patch_w || !c->w_patch_b ||
            !c->w_vith_pos_embed || !c->w_norm_w || !c->w_norm_b) {
            cuda_sam3d_body_destroy(c); return NULL;
        }

        for (int i = 0; i < SB_VITH_N_BLK; i++) {
            if (sb_load_block_vith(c, i) < 0) {
                fprintf(stderr, "sam3d_body_vith: failed to load block %d\n", i);
                cuda_sam3d_body_destroy(c); return NULL;
            }
        }

        c->weights_ready = 1;
        if (c->verbose >= 1)
            fprintf(stderr, "sam3d_body_vith: encoder weights uploaded "
                            "(%d blocks, D=%d, FFN=%d, head_dim=%d, sm_%d)\n",
                    SB_VITH_N_BLK, SB_VITH_DIM, SB_VITH_FFN, SB_VITH_HEAD_DIM, c->sm);

        /* Decoder + MHR loading is shared between dinov3 and vit-h (the heads
         * + MHR rig are variant-tagged but loaded by the same code below).
         * Jump past the dinov3-specific block tensor uploads and into the
         * shared decoder/MHR section. */
        goto load_decoder_and_mhr;
    }

    snprintf(path, sizeof(path), "%s/sam3d_body_dinov3.safetensors",
             cfg->safetensors_dir);
    c->st_enc = safetensors_open(path);
    if (!c->st_enc) {
        fprintf(stderr, "sam3d_body: cannot open %s\n", path);
        cuda_sam3d_body_destroy(c); return NULL;
    }
    if (c->verbose >= 1)
        fprintf(stderr, "sam3d_body: opened %s\n", path);

    /* Non-block tensors. */
    c->w_patch_w       = sb_upload_f32(c->st_enc, "patch_embed.proj.weight",
                                       (size_t)SB_DIM * 3 * SB_PATCH * SB_PATCH);
    c->w_patch_b       = sb_upload_f32(c->st_enc, "patch_embed.proj.bias", SB_DIM);
    c->w_cls           = sb_upload_f32(c->st_enc, "cls_token", SB_DIM);
    c->w_storage       = sb_upload_f32(c->st_enc, "storage_tokens",
                                       (size_t)SB_N_STORAGE * SB_DIM);
    c->w_rope_periods  = sb_upload_f32(c->st_enc, "rope_embed.periods", 16);
    c->w_norm_w        = sb_upload_f32(c->st_enc, "norm.weight", SB_DIM);
    c->w_norm_b        = sb_upload_f32(c->st_enc, "norm.bias",   SB_DIM);
    if (!c->w_patch_w || !c->w_patch_b || !c->w_cls || !c->w_storage ||
        !c->w_rope_periods || !c->w_norm_w || !c->w_norm_b) {
        cuda_sam3d_body_destroy(c); return NULL;
    }

    /* Build 2D RoPE cos/sin tables host-side from rope_embed.periods.
     * Layout matches common/dinov3.h: [sin_y(rope_dim4), sin_x(rope_dim4),
     * sin_y, sin_x] tiled across head_dim, computed for each position on
     * the configured DINOv3 patch grid. */
    {
        const int gh = c->cfg.image_height / SB_PATCH;
        const int gw = c->cfg.image_width / SB_PATCH;
        const int hd = SB_HEAD_DIM;
        const int rope_dim4 = hd / 4;       /* 16 */
        const int np = gh * gw;
        int p_idx = sb_find(c->st_enc, "rope_embed.periods");
        if (p_idx < 0) { cuda_sam3d_body_destroy(c); return NULL; }
        const float *periods = (const float *)
            safetensors_data(c->st_enc, p_idx);
        float *rcos = (float *)malloc((size_t)np * hd * sizeof(float));
        float *rsin = (float *)malloc((size_t)np * hd * sizeof(float));
        if (!rcos || !rsin) {
            free(rcos); free(rsin);
            cuda_sam3d_body_destroy(c); return NULL;
        }
        for (int p = 0; p < np; p++) {
            int py = p / gw, px = p % gw;
            float cy = ((0.5f + (float)py) / (float)gh) * 2.0f - 1.0f;
            float cx = ((0.5f + (float)px) / (float)gw) * 2.0f - 1.0f;
            float *s = rsin + (size_t)p * hd;
            float *kc = rcos + (size_t)p * hd;
            for (int j = 0; j < rope_dim4; j++) {
                float ay = 2.0f * 3.14159265358979323846f * cy / periods[j];
                float ax = 2.0f * 3.14159265358979323846f * cx / periods[j];
                float sy = sinf(ay), sx = sinf(ax);
                float cyv = cosf(ay), cxv = cosf(ax);
                s[j]                = sy;
                s[rope_dim4 + j]    = sx;
                s[2 * rope_dim4 + j] = sy;
                s[3 * rope_dim4 + j] = sx;
                kc[j]                = cyv;
                kc[rope_dim4 + j]    = cxv;
                kc[2 * rope_dim4 + j] = cyv;
                kc[3 * rope_dim4 + j] = cxv;
            }
        }
        c->w_rope_cos = hip_upload_raw(rcos, (size_t)np * hd * sizeof(float));
        c->w_rope_sin = hip_upload_raw(rsin, (size_t)np * hd * sizeof(float));
        free(rcos); free(rsin);
        if (!c->w_rope_cos || !c->w_rope_sin) {
            cuda_sam3d_body_destroy(c); return NULL;
        }
        if (c->verbose >= 1)
            fprintf(stderr, "sam3d_body: built 2D RoPE tables (%dx%d, %d)\n",
                    gh, gw, hd);
    }

    /* 32 blocks. */
    for (int i = 0; i < SB_N_BLK; i++) {
        if (sb_load_block(c, i) < 0) {
            fprintf(stderr, "sam3d_body: failed to load block %d\n", i);
            cuda_sam3d_body_destroy(c); return NULL;
        }
    }

