lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
        /* residual: d_tok += d_proj (no LayerScale for ViT-H). */
        {
            struct __attribute__((packed)) {
                void *a; const void *b; int n;
            } p = { ctx->d_tok, ctx->d_proj, N_TOK * D };
            unsigned total = (unsigned)(N_TOK * D);
            if (sb_launch(ctx->fn_add_inplace, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }

        /* LN2: d_ln <- LN(d_tok). */
        {
            struct __attribute__((packed)) {
                void *dst; const void *src, *w, *bb; int dim; float eps;
            } p = { ctx->d_ln, ctx->d_tok, b->norm2_w, b->norm2_b,
                    D, SB_VITH_LN_EPS };
            if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                          256 * 4, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }

        /* fc1: d_gate <- gemm(fc1_w, d_ln) + fc1_b.  (N, FFN) */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_gate, b->fc1_w, ctx->d_ln, b->fc1_b,
                    FFN, D, N_TOK };
            if (sb_launch(ctx->fn_gemm_tiled,
                          (unsigned)((FFN + 63) / 64),
                          (unsigned)((N_TOK + 15) / 16), 1, 16, 16, 1,
                          0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }

        /* GELU in-place. */
        {
            struct __attribute__((packed)) {
                void *x; int n;
            } p = { ctx->d_gate, N_TOK * FFN };
            unsigned total = (unsigned)(N_TOK * FFN);
            if (sb_launch(ctx->fn_gelu_inplace, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }

        /* fc2: d_proj <- gemm(fc2_w, d_gate) + fc2_b.  (N, D) */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_proj, b->fc2_w, ctx->d_gate, b->fc2_b,
                    D, FFN, N_TOK };
            if (sb_launch(ctx->fn_gemm_tiled,
                          (unsigned)((D + 63) / 64),
                          (unsigned)((N_TOK + 15) / 16), 1, 16, 16, 1,
                          0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }

        /* residual: d_tok += d_proj. */
        {
            struct __attribute__((packed)) {
                void *a; const void *b; int n;
            } p = { ctx->d_tok, ctx->d_proj, N_TOK * D };
            unsigned total = (unsigned)(N_TOK * D);
            if (sb_launch(ctx->fn_add_inplace, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
    }

    /* last_norm: d_proj <- LN(d_tok, last_norm_w, last_norm_b). */
    {
        struct __attribute__((packed)) {
            void *dst; const void *src, *w, *bb; int dim; float eps;
        } p = { ctx->d_proj, ctx->d_tok, ctx->w_norm_w, ctx->w_norm_b,
                D, SB_VITH_LN_EPS };
        if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                      256 * 4, &p, sizeof(p)) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;
    }

    if (hipDeviceSynchronize() != hipSuccess) return CUDA_SAM3D_BODY_E_LOAD;

    /* Copy final encoder tokens to host as (N_TOK, D) row-major. */
    free(ctx->encoder_tokens.data);
    ctx->encoder_tokens.data =
        (float *)malloc((size_t)N_TOK * D * sizeof(float));
    if (!ctx->encoder_tokens.data) return CUDA_SAM3D_BODY_E_LOAD;
    if (hipMemcpy(ctx->encoder_tokens.data, ctx->d_proj,
                  (size_t)N_TOK * D * sizeof(float),
                  hipMemcpyDeviceToHost) != hipSuccess)
        return CUDA_SAM3D_BODY_E_LOAD;
    ctx->encoder_tokens.n = N_TOK;
    ctx->encoder_tokens.c = D;

    if (ctx->verbose >= 1)
        fprintf(stderr, "sam3d_body_vith: encoder forward done "
                        "(%d blocks, N_TOK=%d, D=%d)\n",
                SB_VITH_N_BLK, N_TOK, D);

    return CUDA_SAM3D_BODY_E_OK;
}

int cuda_sam3d_body_run_encoder(cuda_sam3d_body_ctx *ctx)
{
    if (!ctx) return CUDA_SAM3D_BODY_E_INVAL;
    if (!ctx->weights_ready) return CUDA_SAM3D_BODY_E_LOAD;
    if (!ctx->image_rgb && !ctx->has_norm_input)
        return CUDA_SAM3D_BODY_E_INVAL;

    const double t_encoder0 = sb_time_ms();

    if (ctx->cfg.backbone == CUDA_SAM3D_BODY_BACKBONE_VITH) {
        /* Host-side preprocess for vit_hmr_512_384: TopdownAffine to a
         * 512×512 canvas + ImageNet norm + W-axis crop [:, :, :, 64:-64]
         * → (3, 512, 384). Mirrors the CPU runner. Skipped if the verify
         * path already populated d_img_f32 via debug_set_normalized_input. */
        if (!ctx->has_norm_input) {
            const int S = SB_VITH_IMG_H;        /* 512 */
            const int W_crop = SB_VITH_IMG_W;   /* 384 */
            float bbox_xyxy[4];
            if (ctx->has_bbox) {
                memcpy(bbox_xyxy, ctx->bbox, sizeof(bbox_xyxy));
            } else {
                bbox_xyxy[0] = 0; bbox_xyxy[1] = 0;
                bbox_xyxy[2] = (float)ctx->img_w; bbox_xyxy[3] = (float)ctx->img_h;
            }
            sam3d_body_compute_bbox_affine(bbox_xyxy, /*padding=*/1.25f,
                                           /*aspect_ratio_pre=*/0.75f, S, S,
                                           ctx->self_center, ctx->self_scale,
                                           ctx->self_warp);
            sam3d_body_default_cam_int(ctx->img_w, ctx->img_h, ctx->self_cam_int);
            if (ctx->focal_hint > 0) {
                ctx->self_cam_int[0] = ctx->focal_hint;
                ctx->self_cam_int[4] = ctx->focal_hint;
            }
            ctx->self_pp_set = 1;

            float *chw_full = (float *)malloc((size_t)3 * S * S * sizeof(float));
            if (!chw_full) return CUDA_SAM3D_BODY_E_LOAD;
            if (sam3d_body_preprocess_image(ctx->image_rgb, ctx->img_w, ctx->img_h,
                                            ctx->self_warp, S, S, chw_full) != 0) {
                free(chw_full);
                return CUDA_SAM3D_BODY_E_LOAD;
            }
            float *chw_crop = (float *)malloc((size_t)3 * S * W_crop * sizeof(float));
            if (!chw_crop) { free(chw_full); return CUDA_SAM3D_BODY_E_LOAD; }
            for (int c = 0; c < 3; c++) {
                for (int y = 0; y < S; y++) {
                    const float *src = chw_full + ((size_t)c * S + y) * S + 64;
                    float       *dst = chw_crop + ((size_t)c * S + y) * W_crop;
                    memcpy(dst, src, (size_t)W_crop * sizeof(float));
                }
            }
            free(chw_full);

            size_t bytes = (size_t)3 * S * W_crop * sizeof(float);
            if (!ctx->d_img_f32) {
                if (hipMalloc(&ctx->d_img_f32, bytes) != hipSuccess) {
                    free(chw_crop);
                    return CUDA_SAM3D_BODY_E_LOAD;
                }
            }
            if (hipMemcpy(ctx->d_img_f32, chw_crop, bytes,
                          hipMemcpyHostToDevice) != hipSuccess) {
                free(chw_crop);
                return CUDA_SAM3D_BODY_E_LOAD;
            }
            free(chw_crop);
            ctx->has_norm_input = 1;
        }
        return cuda_sam3d_body_run_encoder_vith(ctx);
    }

    const int IMG_H = ctx->cfg.image_height;
    const int IMG_W = ctx->cfg.image_width;
    const int GH  = IMG_H / SB_PATCH;
    const int GW  = IMG_W / SB_PATCH;
    const int N_PATCH = GH * GW;
    const int N_TOK   = 1 + SB_N_STORAGE + N_PATCH;
    double t_preprocess_ms = 0.0;
    double t_embed_ms = 0.0;
    double t_blocks_ms = 0.0;
    double t_final_norm_ms = 0.0;
    double t_readback_ms = 0.0;

    if (!ctx->d_tok) {
        if (hipMalloc(&ctx->d_tok,
                      (size_t)N_TOK * SB_DIM * sizeof(float)) != hipSuccess)
            return CUDA_SAM3D_BODY_E_LOAD;
    }

