lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
    if (!ctx->has_norm_input) {
        /* Match the CPU runner's preprocess: TopdownAffine (bbox + 0.75
         * aspect ratio + 1.25 padding) → cv2.warpAffine → ImageNet norm
         * → HWC→CHW. We do this on the host (sam3d_body_preprocess_image)
         * and upload the (3, IMG_H, IMG_W) f32 result; on-device naive
         * bilinear resize would feed DINOv3 a stretched image when the
         * input aspect ratio differs from the crop aspect. */
        const double t0 = sb_time_ms();
        float bbox_xyxy[4];
        if (ctx->has_bbox) {
            memcpy(bbox_xyxy, ctx->bbox, sizeof(bbox_xyxy));
        } else {
            bbox_xyxy[0] = 0; bbox_xyxy[1] = 0;
            bbox_xyxy[2] = (float)ctx->img_w; bbox_xyxy[3] = (float)ctx->img_h;
        }
        float aspect_ratio_pre = 0.75f;
        if (IMG_H != IMG_W)
            aspect_ratio_pre = (float)IMG_W / (float)IMG_H;
        sam3d_body_compute_bbox_affine(bbox_xyxy, /*padding=*/1.25f,
                                       aspect_ratio_pre, IMG_W, IMG_H,
                                       ctx->self_center, ctx->self_scale,
                                       ctx->self_warp);
        sam3d_body_default_cam_int(ctx->img_w, ctx->img_h, ctx->self_cam_int);
        if (ctx->focal_hint > 0) {
            ctx->self_cam_int[0] = ctx->focal_hint;
            ctx->self_cam_int[4] = ctx->focal_hint;
        }
        ctx->self_pp_set = 1;

        float *chw = (float *)malloc((size_t)3 * IMG_H * IMG_W * sizeof(float));
        if (!chw) return CUDA_SAM3D_BODY_E_LOAD;
        if (sam3d_body_preprocess_image(ctx->image_rgb, ctx->img_w, ctx->img_h,
                                        ctx->self_warp, IMG_W, IMG_H, chw) != 0) {
            free(chw);
            return CUDA_SAM3D_BODY_E_LOAD;
        }

        if (!ctx->d_img_f32) {
            if (hipMalloc(&ctx->d_img_f32,
                          (size_t)3 * IMG_H * IMG_W * sizeof(float)) != hipSuccess) {
                free(chw);
                return CUDA_SAM3D_BODY_E_LOAD;
            }
        }
        if (hipMemcpy(ctx->d_img_f32, chw,
                      (size_t)3 * IMG_H * IMG_W * sizeof(float),
                      hipMemcpyHostToDevice) != hipSuccess) {
            free(chw);
            return CUDA_SAM3D_BODY_E_LOAD;
        }
        free(chw);
        t_preprocess_ms = sb_time_ms() - t0;
    }

    const double t_embed0 = sb_time_ms();

    /* prepend CLS + 4 storage tokens → rows 0..4 */
    {
        struct __attribute__((packed)) {
            void *out; const void *cls; const void *storage;
            int n_storage, dim;
        } p = { ctx->d_tok, ctx->w_cls, ctx->w_storage, SB_N_STORAGE, SB_DIM };
        unsigned total = (unsigned)((1 + SB_N_STORAGE) * SB_DIM);
        if (sb_launch(ctx->fn_prepend, (total + 255) / 256, 1, 1, 256, 1, 1,
                      0, &p, sizeof(p)) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;
    }

    /* patch embed → rows 5..5+1024 */
    {
        struct __attribute__((packed)) {
            void *out; const void *img; const void *w; const void *bias;
            int gw, dim, ps, img_h, img_w, base_tok;
        } p = { ctx->d_tok, ctx->d_img_f32, ctx->w_patch_w, ctx->w_patch_b,
                GW, SB_DIM, SB_PATCH, IMG_H, IMG_W, 1 + SB_N_STORAGE };
        if (sb_launch(ctx->fn_patch, (unsigned)N_PATCH, 1, 1, 256, 1, 1,
                      0, &p, sizeof(p)) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;
    }
    if (sb_bf16_round(ctx, ctx->d_tok, N_TOK * SB_DIM) < 0)
        return CUDA_SAM3D_BODY_E_LOAD;
    if (hipDeviceSynchronize() != hipSuccess) return CUDA_SAM3D_BODY_E_LOAD;
    t_embed_ms = sb_time_ms() - t_embed0;

    /* Allocate per-block runtime scratch on first use. */
    #define ENSURE(field, bytes) do { \
        if (!ctx->field) { \
            if (hipMalloc(&ctx->field, (bytes)) != hipSuccess) \
                return CUDA_SAM3D_BODY_E_LOAD; \
        } \
    } while (0)
    ENSURE(d_ln,   (size_t)N_TOK * SB_DIM * sizeof(float));
    ENSURE(d_qkv,  (size_t)N_TOK * 3 * SB_DIM * sizeof(float));
    ENSURE(d_kt,   (size_t)SB_HEADS * N_TOK * SB_HEAD_DIM * sizeof(float));
    ENSURE(d_vt,   (size_t)SB_HEADS * N_TOK * SB_HEAD_DIM * sizeof(float));
    ENSURE(d_attn, (size_t)N_TOK * SB_DIM * sizeof(float));
    ENSURE(d_proj, (size_t)N_TOK * SB_DIM * sizeof(float));
    ENSURE(d_gate, (size_t)N_TOK * SB_FFN * sizeof(float));
    ENSURE(d_up,   (size_t)N_TOK * SB_FFN * sizeof(float));
    #undef ENSURE

    /* ─── 32 transformer blocks ─── */
    const double t_blocks0 = sb_time_ms();
    const float scale = 1.0f / sqrtf((float)SB_HEAD_DIM);
    const int patch_start = 1 + SB_N_STORAGE;

    for (int L = 0; L < SB_N_BLK; L++) {
        sb_block *b = &ctx->blk[L];

        /* LN1: d_ln <- LN(d_tok, norm1_w, norm1_b) */
        {
            struct __attribute__((packed)) {
                void *dst; const void *src, *w, *bb; int dim; float eps;
            } p = { ctx->d_ln, ctx->d_tok, b->norm1_w, b->norm1_b,
                    SB_DIM, SB_LN_EPS };
            if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                          256 * 4, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_ln, N_TOK * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* QKV: d_qkv <- gemm(qkv_w, d_ln) + qkv_b. Out cols = 3*D. */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_qkv, b->qkv_w, ctx->d_ln, b->qkv_b,
                    3 * SB_DIM, SB_DIM, N_TOK };
            if (sb_launch(ctx->fn_gemm_tiled,
                          (unsigned)((3 * SB_DIM + 63) / 64),
                          (unsigned)((N_TOK + 15) / 16), 1, 16, 16, 1,
                          0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_qkv, N_TOK * 3 * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* RoPE on Q,K (patch tokens only). */
        {
            struct __attribute__((packed)) {
                void *qkv; const void *cos_t, *sin_t;
                int n_patch, patch_start, heads, head_dim, D;
            } p = { ctx->d_qkv, ctx->w_rope_cos, ctx->w_rope_sin,
                    N_PATCH, patch_start, SB_HEADS, SB_HEAD_DIM, SB_DIM };
            if (sb_launch(ctx->fn_rope_qk, (unsigned)N_PATCH, 1, 1,
                          SB_HEADS, 1, 1, 0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_qkv, N_TOK * 3 * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* kv_transpose: deinterleave K, V into per-head contiguous layout. */
        {
            struct __attribute__((packed)) {
                void *K, *V; const void *qkv;
                int n_tok, dim, heads, hd;
            } p = { ctx->d_kt, ctx->d_vt, ctx->d_qkv,
                    N_TOK, SB_DIM, SB_HEADS, SB_HEAD_DIM };
            unsigned total = (unsigned)(N_TOK * SB_DIM);
            if (sb_launch(ctx->fn_kv_tx, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }

        /* FlashAttention: d_attn <- softmax(Q K^T * scale) V. */
        {
            struct __attribute__((packed)) {
                void *out; const void *qkv, *K, *V;
                int n_tok, dim, heads, hd; float sc;
            } p = { ctx->d_attn, ctx->d_qkv, ctx->d_kt, ctx->d_vt,
                    N_TOK, SB_DIM, SB_HEADS, SB_HEAD_DIM, scale };
            unsigned gy = (unsigned)((N_TOK + 63) / 64);
            unsigned shmem = 2u * 16u * 64u * sizeof(float);
            if (sb_launch(ctx->fn_fa, SB_HEADS, gy, 1, 64, 1, 1,
                          shmem, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_attn, N_TOK * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

