lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
        /* Output projection: d_proj <- gemm(proj_w, d_attn) + proj_b. */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_proj, b->proj_w, ctx->d_attn, b->proj_b,
                    SB_DIM, SB_DIM, N_TOK };
            if (sb_launch(ctx->fn_gemm_tiled,
                          (unsigned)((SB_DIM + 63) / 64),
                          (unsigned)((N_TOK + 15) / 16), 1, 16, 16, 1,
                          0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_proj, N_TOK * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* LayerScale1 + residual: d_tok += d_proj * ls1. */
        {
            struct __attribute__((packed)) {
                void *hidden; const void *proj, *gamma; int n_tok, dim;
            } p = { ctx->d_tok, ctx->d_proj, b->ls1, N_TOK, SB_DIM };
            unsigned total = (unsigned)(N_TOK * SB_DIM);
            if (sb_launch(ctx->fn_layerscale_add, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_tok, N_TOK * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* LN2: d_ln <- LN(d_tok, norm2_w, norm2_b) */
        {
            struct __attribute__((packed)) {
                void *dst; const void *src, *w, *bb; int dim; float eps;
            } p = { ctx->d_ln, ctx->d_tok, b->norm2_w, b->norm2_b,
                    SB_DIM, SB_LN_EPS };
            if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                          256 * 4, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_ln, N_TOK * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* SwiGLU: d_gate <- gemm(w1, d_ln) + b1; d_up <- gemm(w2, d_ln) + b2. */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } pg = { ctx->d_gate, b->w1_w, ctx->d_ln, b->w1_b,
                     SB_FFN, SB_DIM, N_TOK };
            if (sb_launch(ctx->fn_gemm_tiled,
                          (unsigned)((SB_FFN + 63) / 64),
                          (unsigned)((N_TOK + 15) / 16), 1, 16, 16, 1,
                          0, &pg, sizeof(pg)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } pu = { ctx->d_up, b->w2_w, ctx->d_ln, b->w2_b,
                     SB_FFN, SB_DIM, N_TOK };
            if (sb_launch(ctx->fn_gemm_tiled,
                          (unsigned)((SB_FFN + 63) / 64),
                          (unsigned)((N_TOK + 15) / 16), 1, 16, 16, 1,
                          0, &pu, sizeof(pu)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_gate, N_TOK * SB_FFN) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;
        if (sb_bf16_round(ctx, ctx->d_up, N_TOK * SB_FFN) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* d_gate := silu(d_gate) * d_up. */
        {
            struct __attribute__((packed)) {
                void *gate; const void *up; int n;
            } p = { ctx->d_gate, ctx->d_up, N_TOK * SB_FFN };
            unsigned total = (unsigned)(N_TOK * SB_FFN);
            if (sb_launch(ctx->fn_silu_mul, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_gate, N_TOK * SB_FFN) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* w3: d_proj <- gemm(w3, d_gate) + b3.   (FFN→D)  reuse d_proj */
        {
            struct __attribute__((packed)) {
                void *Y; const void *W, *X, *bias; int n_out, n_in, n_tok;
            } p = { ctx->d_proj, b->w3_w, ctx->d_gate, b->w3_b,
                    SB_DIM, SB_FFN, N_TOK };
            if (sb_launch(ctx->fn_gemm_tiled,
                          (unsigned)((SB_DIM + 63) / 64),
                          (unsigned)((N_TOK + 15) / 16), 1, 16, 16, 1,
                          0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_proj, N_TOK * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;

        /* LayerScale2 + residual: d_tok += d_proj * ls2. */
        {
            struct __attribute__((packed)) {
                void *hidden; const void *proj, *gamma; int n_tok, dim;
            } p = { ctx->d_tok, ctx->d_proj, b->ls2, N_TOK, SB_DIM };
            unsigned total = (unsigned)(N_TOK * SB_DIM);
            if (sb_launch(ctx->fn_layerscale_add, (total + 255) / 256, 1, 1,
                          256, 1, 1, 0, &p, sizeof(p)) < 0)
                return CUDA_SAM3D_BODY_E_LOAD;
        }
        if (sb_bf16_round(ctx, ctx->d_tok, N_TOK * SB_DIM) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;
    }
    if (hipDeviceSynchronize() != hipSuccess) return CUDA_SAM3D_BODY_E_LOAD;
    t_blocks_ms = sb_time_ms() - t_blocks0;

    /* Final LayerNorm in-place via d_proj scratch, then copy back to d_tok. */
    const double t_final0 = sb_time_ms();
    {
        struct __attribute__((packed)) {
            void *dst; const void *src, *w, *bb; int dim; float eps;
        } p = { ctx->d_proj, ctx->d_tok, ctx->w_norm_w, ctx->w_norm_b,
                SB_DIM, SB_LN_EPS };
        if (sb_launch(ctx->fn_ln, N_TOK, 1, 1, 256, 1, 1,
                      256 * 4, &p, sizeof(p)) < 0)
            return CUDA_SAM3D_BODY_E_LOAD;
    }
    if (sb_bf16_round(ctx, ctx->d_proj, N_TOK * SB_DIM) < 0)
        return CUDA_SAM3D_BODY_E_LOAD;

    if (hipDeviceSynchronize() != hipSuccess) return CUDA_SAM3D_BODY_E_LOAD;
    t_final_norm_ms = sb_time_ms() - t_final0;

    /* Copy final encoder tokens (post-LN) to host. */
    const double t_read0 = sb_time_ms();
    free(ctx->encoder_tokens.data);
    ctx->encoder_tokens.data =
        (float *)malloc((size_t)N_TOK * SB_DIM * sizeof(float));
    if (!ctx->encoder_tokens.data) return CUDA_SAM3D_BODY_E_LOAD;
    if (hipMemcpy(ctx->encoder_tokens.data, ctx->d_proj,
                  (size_t)N_TOK * SB_DIM * sizeof(float),
                  hipMemcpyDeviceToHost) != hipSuccess)
        return CUDA_SAM3D_BODY_E_LOAD;
    ctx->encoder_tokens.n = N_TOK;
    ctx->encoder_tokens.c = SB_DIM;
    t_readback_ms = sb_time_ms() - t_read0;

    if (ctx->verbose >= 1) {
        fprintf(stderr, "sam3d_body: encoder forward done "
                        "(%d blocks, N_TOK=%d, D=%d)\n",
                SB_N_BLK, N_TOK, SB_DIM);
        fprintf(stderr,
                "[sam3d_body][timing] encoder total %.3f ms "
                "(preprocess+upload %.3f, prepend+patch %.3f, "
                "blocks %.3f, final_norm %.3f, readback %.3f)\n",
                sb_time_ms() - t_encoder0, t_preprocess_ms, t_embed_ms,
                t_blocks_ms, t_final_norm_ms, t_readback_ms);
    }

