lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
    return CUDA_SAM3D_BODY_E_OK;
}

/* Self-driven decoder forward. Mirrors cpu/sam3d_body/sam3d_body_runner.c
 * (self_drive_decoder_inputs + sam3d_body_decoder_forward_full) but the
 * heavy GEMMs (ray_cond_emb, build_tokens, the 6 decoder layers,
 * norm_final + heads, kp_token_update) run on the GPU via the
 * cuda_sam3d_body_debug_run_* entry points used by verify_decoder.c.
 *
 * MHR skinning + keypoints_from_mesh + camera_project still run on the
 * CPU (Step 7 — CUDA MHR — is deferred per the original plan). */
int cuda_sam3d_body_run_decoder(cuda_sam3d_body_ctx *ctx)
{
    if (!ctx) return CUDA_SAM3D_BODY_E_INVAL;
    if (!ctx->encoder_tokens.data) {
        fprintf(stderr, "[cuda_sam3d_body] run_decoder: encoder tokens "
                        "not populated — call run_encoder first\n");
        return CUDA_SAM3D_BODY_E_INVAL;
    }
    if (!ctx->cpu_dec) return CUDA_SAM3D_BODY_E_INVAL;
    if (!ctx->cpu_mhr) {
        fprintf(stderr, "[cuda_sam3d_body] run_decoder: MHR assets not "
                        "loaded — set cfg.mhr_assets_dir at create time\n");
        return CUDA_SAM3D_BODY_E_INVAL;
    }

    const double t_decoder0 = sb_time_ms();
    double t_geom_ms = 0.0, t_encoder_permute_ms = 0.0, t_rays_ms = 0.0;
    double t_ray_cond_ms = 0.0, t_dense_pe_ms = 0.0, t_ctx_permute_ms = 0.0;
    double t_condition_ms = 0.0, t_build_tokens_ms = 0.0, t_workspace_ms = 0.0;
    double t_layer_ms[SB_DEC_LAYERS] = {0};
    double t_norm_heads_ms[SB_DEC_LAYERS + 1] = {0};
    double t_decode_pose_ms[SB_DEC_LAYERS + 1] = {0};
    double t_mhr_ms[SB_DEC_LAYERS + 1] = {0};
    double t_keypoints_ms[SB_DEC_LAYERS + 1] = {0};
    double t_project_ms[SB_DEC_LAYERS + 1] = {0};
    double t_kp_update_ms[SB_DEC_LAYERS] = {0};
    double t_output_ms = 0.0;

    const sam3d_body_decoder_model *m = ctx->cpu_dec;
    const int Dc  = m->kv_dim;          /* 1280 */
    const int D   = m->dim;             /* 1024 */
    const int K   = m->n_keypoints;     /* 70 */
    const int NL  = m->n_layers;        /* 6 */
    const int N_Q = 1 + 1 + 1 + m->n_hand_tokens + 2 * K;  /* 145 */
    const int V   = 18439;
    const int J   = 127;
    /* Encoder-grid + image-size geometry depends on backbone:
     *   dinov3-h+:  configurable patch-aligned HxW, n_prefix=5 (CLS + 4 reg)
     *   vit-h:      IMG_H=512, IMG_W=384, gh=32, gw=24, N_C=768, n_prefix=0 */
    const int is_vith = (ctx->cfg.backbone == CUDA_SAM3D_BODY_BACKBONE_VITH);
    const int IMG_H = is_vith ? SB_VITH_IMG_H : ctx->cfg.image_height;
    const int IMG_W = is_vith ? SB_VITH_IMG_W : ctx->cfg.image_width;
    const int gh    = is_vith ? SB_VITH_GRID_H : (ctx->cfg.image_height / SB_PATCH);
    const int gw    = is_vith ? SB_VITH_GRID_W : (ctx->cfg.image_width / SB_PATCH);
    const int N_C   = gh * gw;
    const int n_prefix = is_vith ? 0 : (1 + SB_N_STORAGE);

    if (ctx->encoder_tokens.n != n_prefix + N_C ||
        ctx->encoder_tokens.c != Dc) {
        fprintf(stderr, "[cuda_sam3d_body] encoder shape mismatch: "
                        "tokens=(%d,%d), expected (%d,%d)\n",
                ctx->encoder_tokens.n, ctx->encoder_tokens.c,
                n_prefix + N_C, Dc);
        return CUDA_SAM3D_BODY_E_INVAL;
    }

    /* TopdownAffine + cam_int are cached by run_encoder so the warp
     * matrix used to produce the DINOv3 input matches the rays_xyz /
     * cam_int seen by the decoder. Fall back to recomputing only if the
     * encoder was driven via the debug normalized-input path. */
    float bbox_xyxy[4], center[2], scale[2], warp[6], cam_int[9];
    const double t_geom0 = sb_time_ms();
    if (ctx->self_pp_set) {
        memcpy(center,  ctx->self_center,  sizeof(center));
        memcpy(scale,   ctx->self_scale,   sizeof(scale));
        memcpy(warp,    ctx->self_warp,    sizeof(warp));
        memcpy(cam_int, ctx->self_cam_int, sizeof(cam_int));
    } else {
        if (ctx->has_bbox) {
            memcpy(bbox_xyxy, ctx->bbox, sizeof(bbox_xyxy));
        } else {
            bbox_xyxy[0] = 0; bbox_xyxy[1] = 0;
            bbox_xyxy[2] = (float)ctx->img_w; bbox_xyxy[3] = (float)ctx->img_h;
        }
        /* Recompute the same affine shape that run_encoder would have cached.
         * ViT-H still uses the upstream 512x512 canvas before W-axis crop. */
        int affine_w = IMG_W, affine_h = IMG_H;
        float aspect_ratio_pre = 0.75f;
        if (is_vith) {
            affine_w = SB_VITH_IMG_H;
            affine_h = SB_VITH_IMG_H;
        } else if (IMG_H != IMG_W) {
            aspect_ratio_pre = (float)IMG_W / (float)IMG_H;
        }
        sam3d_body_compute_bbox_affine(bbox_xyxy, /*padding=*/1.25f,
                                       aspect_ratio_pre,
                                       affine_w, affine_h,
                                       center, scale, warp);
        sam3d_body_default_cam_int(ctx->img_w, ctx->img_h, cam_int);
        if (ctx->focal_hint > 0) {
            cam_int[0] = ctx->focal_hint;
            cam_int[4] = ctx->focal_hint;
        }
    }
    (void)bbox_xyxy;
    t_geom_ms = sb_time_ms() - t_geom0;

    float warp_for_rays[6];
    memcpy(warp_for_rays, warp, sizeof(warp_for_rays));
    int ray_img_h = IMG_H;
    int ray_img_w = IMG_W;
    int ray_rect_reinterpret = (!is_vith && IMG_H != IMG_W);
    if (is_vith) {
        ray_img_h = SB_VITH_IMG_H;
        ray_img_w = SB_VITH_IMG_H;
    }

    /* ---- Permute encoder tokens (drop CLS+regs) → image_emb_pre (Dc, H, W). ---- */
    const double t_perm0 = sb_time_ms();
    float *img_emb_pre = (float *)malloc((size_t)Dc * N_C * sizeof(float));
    if (!img_emb_pre) return CUDA_SAM3D_BODY_E_LOAD;
    {
        const float *patch = ctx->encoder_tokens.data + (size_t)n_prefix * Dc;
        const float *no_mask = ctx->dec.no_mask_embed_h;
        if (!no_mask) { free(img_emb_pre); return CUDA_SAM3D_BODY_E_LOAD; }
        for (int n = 0; n < N_C; n++)
            for (int c = 0; c < Dc; c++)
                img_emb_pre[(size_t)c * N_C + n] =
                    patch[(size_t)n * Dc + c] + no_mask[c];
    }
    t_encoder_permute_ms = sb_time_ms() - t_perm0;

