lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
int cuda_sam3d_body_run_all(cuda_sam3d_body_ctx *ctx)
{
    const double t0 = sb_time_ms();
    double t_encoder = 0.0, t_decoder = 0.0, t_mhr = 0.0;
    double s = sb_time_ms();
    int rc = cuda_sam3d_body_run_encoder(ctx);
    if (rc != CUDA_SAM3D_BODY_E_OK) return rc;
    t_encoder = sb_time_ms() - s;
    s = sb_time_ms();
    rc = cuda_sam3d_body_run_decoder(ctx);
    if (rc != CUDA_SAM3D_BODY_E_OK) return rc;
    t_decoder = sb_time_ms() - s;
    s = sb_time_ms();
    rc = cuda_sam3d_body_run_mhr(ctx);
    t_mhr = sb_time_ms() - s;
    if (ctx && ctx->verbose >= 1) {
        fprintf(stderr,
                "[sam3d_body][timing] run_all total %.3f ms "
                "(encoder %.3f, decoder %.3f, mhr_shim %.3f)\n",
                sb_time_ms() - t0, t_encoder, t_decoder, t_mhr);
    }
    return rc;
}

int cuda_sam3d_body_get_encoder_tokens(cuda_sam3d_body_ctx *ctx,
                                       float *out, int *out_n, int *out_dim)
{
    if (!ctx || !out_n || !out_dim) return CUDA_SAM3D_BODY_E_INVAL;
    *out_n = ctx->encoder_tokens.n;
    *out_dim = ctx->encoder_tokens.c;
    if (out && ctx->encoder_tokens.data)
        memcpy(out, ctx->encoder_tokens.data,
               (size_t)ctx->encoder_tokens.n *
               (size_t)ctx->encoder_tokens.c * sizeof(float));
    return ctx->encoder_tokens.data ? CUDA_SAM3D_BODY_E_OK
                                    : CUDA_SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int cuda_sam3d_body_get_mhr_params(cuda_sam3d_body_ctx *ctx, float *out, int *out_n)
{
    if (!ctx || !out_n) return CUDA_SAM3D_BODY_E_INVAL;
    *out_n = ctx->mhr_params_n;
    if (out && ctx->mhr_params)
        memcpy(out, ctx->mhr_params, (size_t)ctx->mhr_params_n * sizeof(float));
    return ctx->mhr_params ? CUDA_SAM3D_BODY_E_OK
                           : CUDA_SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int cuda_sam3d_body_get_cam(cuda_sam3d_body_ctx *ctx,
                            float *out_cam_t_xyz, float *out_focal_px)
{
    if (!ctx) return CUDA_SAM3D_BODY_E_INVAL;
    if (out_cam_t_xyz) memcpy(out_cam_t_xyz, ctx->cam_t, sizeof(ctx->cam_t));
    if (out_focal_px)  *out_focal_px = ctx->focal_px;
    return ctx->focal_px > 0 ? CUDA_SAM3D_BODY_E_OK
                             : CUDA_SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int cuda_sam3d_body_get_vertices(cuda_sam3d_body_ctx *ctx, float *out, int *out_v)
{
    if (!ctx || !out_v) return CUDA_SAM3D_BODY_E_INVAL;
    *out_v = ctx->n_vertices;
    if (out && ctx->vertices)
        memcpy(out, ctx->vertices, (size_t)ctx->n_vertices * 3 * sizeof(float));
    return ctx->vertices ? CUDA_SAM3D_BODY_E_OK
                         : CUDA_SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int cuda_sam3d_body_get_faces(cuda_sam3d_body_ctx *ctx, int32_t *out, int *out_f)
{
    if (!ctx || !out_f) return CUDA_SAM3D_BODY_E_INVAL;
    *out_f = ctx->n_faces;
    if (out && ctx->faces)
        memcpy(out, ctx->faces, (size_t)ctx->n_faces * 3 * sizeof(int32_t));
    return ctx->faces ? CUDA_SAM3D_BODY_E_OK : CUDA_SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int cuda_sam3d_body_get_keypoints_3d(cuda_sam3d_body_ctx *ctx, float *out, int *out_k)
{
    if (!ctx || !out_k) return CUDA_SAM3D_BODY_E_INVAL;
    *out_k = ctx->n_kp_3d;
    if (out && ctx->keypoints_3d)
        memcpy(out, ctx->keypoints_3d, (size_t)ctx->n_kp_3d * 3 * sizeof(float));
    return ctx->keypoints_3d ? CUDA_SAM3D_BODY_E_OK
                             : CUDA_SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int cuda_sam3d_body_get_keypoints_2d(cuda_sam3d_body_ctx *ctx, float *out, int *out_k)
{
    if (!ctx || !out_k) return CUDA_SAM3D_BODY_E_INVAL;
    *out_k = ctx->n_kp_2d;
    if (out && ctx->keypoints_2d)
        memcpy(out, ctx->keypoints_2d, (size_t)ctx->n_kp_2d * 2 * sizeof(float));
    return ctx->keypoints_2d ? CUDA_SAM3D_BODY_E_OK
                             : CUDA_SAM3D_BODY_E_NOT_IMPLEMENTED;
}

int cuda_sam3d_body_debug_override_encoder(cuda_sam3d_body_ctx *ctx,
                                           const float *tokens, int n, int dim)
{
    if (!ctx || !tokens || n <= 0 || dim <= 0) return CUDA_SAM3D_BODY_E_INVAL;
    free(ctx->encoder_tokens.data);
    ctx->encoder_tokens.data = (float *)malloc((size_t)n * dim * sizeof(float));
    if (!ctx->encoder_tokens.data) return CUDA_SAM3D_BODY_E_INVAL;
    memcpy(ctx->encoder_tokens.data, tokens, (size_t)n * dim * sizeof(float));
    ctx->encoder_tokens.n = n; ctx->encoder_tokens.c = dim;
    return CUDA_SAM3D_BODY_E_OK;
}

int cuda_sam3d_body_debug_override_mhr_params(cuda_sam3d_body_ctx *ctx,
                                              const float *params, int n)
{
    if (!ctx || !params || n <= 0) return CUDA_SAM3D_BODY_E_INVAL;
    free(ctx->mhr_params);
    ctx->mhr_params = (float *)malloc((size_t)n * sizeof(float));
    if (!ctx->mhr_params) return CUDA_SAM3D_BODY_E_INVAL;
    memcpy(ctx->mhr_params, params, (size_t)n * sizeof(float));
    ctx->mhr_params_n = n;
    return CUDA_SAM3D_BODY_E_OK;
}

int cuda_sam3d_body_debug_set_normalized_input(cuda_sam3d_body_ctx *ctx,
                                               const float *chw, int H, int W)
{
    if (!ctx || !chw || H <= 0 || W <= 0) return CUDA_SAM3D_BODY_E_INVAL;
    /* DINOv3 accepts the configured HxW; ViT-H remains fixed 512x384. */
    int exp_h, exp_w;
    if (ctx->cfg.backbone == CUDA_SAM3D_BODY_BACKBONE_VITH) {
        exp_h = SB_VITH_IMG_H; exp_w = SB_VITH_IMG_W;
    } else {
        exp_h = ctx->cfg.image_height; exp_w = ctx->cfg.image_width;
    }
    if (H != exp_h || W != exp_w) {
        fprintf(stderr,
                "sam3d_body: normalized input must be %dx%d, got %dx%d\n",
                exp_h, exp_w, H, W);
        return CUDA_SAM3D_BODY_E_INVAL;
    }
    size_t bytes = (size_t)3 * H * W * sizeof(float);
    if (!ctx->d_img_f32) {
        if (hipMalloc(&ctx->d_img_f32, bytes) != hipSuccess)
            return CUDA_SAM3D_BODY_E_LOAD;
    }
    if (hipMemcpy(ctx->d_img_f32, chw, bytes,
                  hipMemcpyHostToDevice) != hipSuccess)
        return CUDA_SAM3D_BODY_E_LOAD;
    ctx->has_norm_input = 1;
    return CUDA_SAM3D_BODY_E_OK;
}

