lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
    /* Slot 0 = init_to_token(init_in). */
    LINEAR((char *)d_x + 0 * row_b,
           ctx->dec.init_to_token_w, ctx->dec.init_to_token_b,
           d_init, D, D_init);
    /* Slot 1 = prev_to_token(prev_in). */
    LINEAR((char *)d_x + 1 * row_b,
           ctx->dec.prev_to_token_w, ctx->dec.prev_to_token_b,
           d_prev, D, D_prev);
    /* Slot 2 = prompt_to_token(prompt_in). */
    LINEAR((char *)d_x + 2 * row_b,
           ctx->dec.prompt_to_token_w, ctx->dec.prompt_to_token_b,
           d_prompt, D, D_prompt);
    #undef LINEAR

    /* Slots 3..4 = hand_box_embedding (2, D). */
    if (hipMemcpy((char *)d_x + 3 * row_b,
                  ctx->dec.hand_box_embedding,
                  (size_t)NHB * row_b,
                  hipMemcpyDeviceToDevice) != hipSuccess) goto fail;
    /* Slots 5..74 = keypoint_embedding (70, D). */
    if (hipMemcpy((char *)d_x + (3 + NHB) * row_b,
                  ctx->dec.keypoint_embedding,
                  (size_t)NKP * row_b,
                  hipMemcpyDeviceToDevice) != hipSuccess) goto fail;
    /* Slots 75..144 = keypoint3d_embedding (70, D). */
    if (hipMemcpy((char *)d_x + (3 + NHB + NKP) * row_b,
                  ctx->dec.keypoint3d_embedding,
                  (size_t)NKP * row_b,
                  hipMemcpyDeviceToDevice) != hipSuccess) goto fail;

    /* x_pe: zero everywhere except slots 1 and 2 (copies of slots 1/2 in x). */
    if (hipMemset(d_xpe, 0, tok_b) != hipSuccess) goto fail;
    if (hipMemcpy((char *)d_xpe + 1 * row_b,
                  (char *)d_x + 1 * row_b, row_b,
                  hipMemcpyDeviceToDevice) != hipSuccess) goto fail;
    if (hipMemcpy((char *)d_xpe + 2 * row_b,
                  (char *)d_x + 2 * row_b, row_b,
                  hipMemcpyDeviceToDevice) != hipSuccess) goto fail;

    if (hipMemcpy(x_out, d_x, tok_b,
                  hipMemcpyDeviceToHost) != hipSuccess) goto fail;
    if (hipMemcpy(x_pe_out, d_xpe, tok_b,
                  hipMemcpyDeviceToHost) != hipSuccess) goto fail;

    hipFree(d_init); hipFree(d_prev); hipFree(d_prompt);
    hipFree(d_x); hipFree(d_xpe);
    return CUDA_SAM3D_BODY_E_OK;

fail:
    if (d_init)   hipFree(d_init);
    if (d_prev)   hipFree(d_prev);
    if (d_prompt) hipFree(d_prompt);
    if (d_x)      hipFree(d_x);
    if (d_xpe)    hipFree(d_xpe);
    return CUDA_SAM3D_BODY_E_LOAD;
}

/* ---- Decoder-layer helpers (host-side launchers) ---- */

static int sb_dec_ln(cuda_sam3d_body_ctx *c, void *dst, const void *src,
                     const void *w, const void *b, int N, int D, float eps)
{
    struct __attribute__((packed)) {
        void *dst; const void *src; const void *w; const void *b;
        int dim; float eps;
    } p = { dst, src, w, b, D, eps };
    return sb_launch(c->fn_ln, (unsigned)N, 1, 1, 256, 1, 1,
                     256 * 4, &p, sizeof(p));
}

static int sb_dec_gemm(cuda_sam3d_body_ctx *c, void *Y, const void *X,
                       const void *W, const void *b,
                       int N, int D_in, int D_out)
{
    struct __attribute__((packed)) {
        void *Y; const void *X; const void *W; const void *b;
        int N; int D_in; int D_out;
    } p = { Y, X, W, b, N, D_in, D_out };
    unsigned bx = 16, by = 16;
    unsigned gx = (unsigned)((N + bx - 1) / bx);
    unsigned gy = (unsigned)((D_out + by - 1) / by);
    return sb_launch(c->fn_gemm_f32, gx, gy, 1, bx, by, 1, 0, &p, sizeof(p));
}

static int sb_dec_add_two(cuda_sam3d_body_ctx *c, void *out, const void *a,
                          const void *b, int n)
{
    struct __attribute__((packed)) {
        void *out; const void *a; const void *b; int n;
    } p = { out, a, b, n };
    unsigned bx = 256;
    unsigned gx = (unsigned)((n + bx - 1) / bx);
    return sb_launch(c->fn_add_two, gx, 1, 1, bx, 1, 1, 0, &p, sizeof(p));
}

static int sb_dec_add_inplace(cuda_sam3d_body_ctx *c, void *a, const void *b, int n)
{
    struct __attribute__((packed)) {
        void *a; const void *b; int n;
    } p = { a, b, n };
    unsigned bx = 256;
    unsigned gx = (unsigned)((n + bx - 1) / bx);
    return sb_launch(c->fn_add_inplace, gx, 1, 1, bx, 1, 1, 0, &p, sizeof(p));
}

static int sb_dec_gelu(cuda_sam3d_body_ctx *c, void *x, int n)
{
    struct __attribute__((packed)) { void *x; int n; } p = { x, n };
    unsigned bx = 256;
    unsigned gx = (unsigned)((n + bx - 1) / bx);
    return sb_launch(c->fn_gelu_inplace, gx, 1, 1, bx, 1, 1, 0, &p, sizeof(p));
}

static int sb_dec_sdpa(cuda_sam3d_body_ctx *c, void *out, const void *q,
                       const void *k, const void *v,
                       int N_q, int N_k, int H, int D_h)
{
    float scale = 1.0f / sqrtf((float)D_h);
    struct __attribute__((packed)) {
        void *out; const void *q; const void *k; const void *v;
        int N_q; int N_k; int H; int D_h; float scale;
    } p = { out, q, k, v, N_q, N_k, H, D_h, scale };
    unsigned shmem = (256 + (unsigned)N_k) * 4u;
    return sb_launch(c->fn_sdpa, (unsigned)N_q, (unsigned)H, 1, 256, 1, 1,
                     shmem, &p, sizeof(p));
}

int cuda_sam3d_body_debug_run_decoder_layer(cuda_sam3d_body_ctx *ctx,
                                            int layer_idx,
                                            const float *x_in,
                                            const float *context_in,
                                            const float *x_pe_in,
                                            const float *context_pe_in,
                                            int N_q, int N_c,
                                            float *x_out)
{
    if (!ctx || !x_in || !context_in || !x_pe_in || !context_pe_in || !x_out)
        return CUDA_SAM3D_BODY_E_INVAL;
    if (!ctx->dec.loaded || layer_idx < 0 || layer_idx >= SB_DEC_LAYERS)
        return CUDA_SAM3D_BODY_E_INVAL;

    const int D    = SB_DEC_DIM;     /* 1024 */
    const int Dc   = SB_DEC_KV_DIM;  /* 1280 */
    const int H    = SB_DEC_HEADS;   /* 8 */
    const int Dh   = SB_DEC_HEAD_DIM;/* 64 */
    const int E    = H * Dh;         /* 512 */
    const int F    = SB_DEC_FFN;     /* 1024 */
    const float eps = SB_DEC_LN_EPS;
    const int skip_first_pe = (layer_idx == 0);

    sb_dec_layer_w *L = &ctx->dec.layers[layer_idx];

    /* Device buffers. */
    void *d_x = NULL, *d_ctx = NULL, *d_xpe = NULL, *d_cpe = NULL;
    void *d_xpe_n = NULL, *d_cpe_n = NULL;
    void *d_x_ln = NULL, *d_qk = NULL;
    void *d_Q = NULL, *d_K = NULL, *d_V = NULL, *d_attn = NULL, *d_proj = NULL;
    void *d_x1 = NULL, *d_q_in = NULL, *d_k_in = NULL, *d_ctx_ln = NULL;
    void *d_x2 = NULL, *d_x_ln3 = NULL, *d_ffn_h = NULL, *d_ffn_o = NULL;

    size_t bx_q = (size_t)N_q * D * sizeof(float);
    size_t bx_c = (size_t)N_c * Dc * sizeof(float);
    size_t b_qE = (size_t)N_q * E * sizeof(float);
    size_t b_qF = (size_t)N_q * F * sizeof(float);

