lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
    /* Last-layer short-circuit (matches sam3d_body_kp_token_update). */
    if (layer_idx == SB_DEC_LAYERS - 1) return 0;

    const int D = SB_DEC_DIM;          /* 1024 */
    const int C = SB_DEC_KV_DIM;       /* 1280 */
    const int K = SB_DEC_KP;           /* 70 */
    const int kp2d_start = 1 + 1 + 1 + SB_DEC_HAND_TOK;          /* 5 */
    const int kp3d_start = kp2d_start + K;                        /* 75 */
    if (kp3d_start + K > N_q) return CUDA_SAM3D_BODY_E_INVAL;

    /* Host-side invalid mask (cheap; K=70). */
    int invalid_h[70];
    for (int i = 0; i < K; i++) {
        float x01 = kp2d_cropped[i*2 + 0] + 0.5f;
        float y01 = kp2d_cropped[i*2 + 1] + 0.5f;
        invalid_h[i] = (x01 < 0.0f) || (x01 > 1.0f) ||
                       (y01 < 0.0f) || (y01 > 1.0f) ||
                       (kp2d_depth[i] < 1e-5f);
    }
    /* Pre-multiply gxy by 2 (sample_points = kp2d_cropped * 2 -> [-1, 1]).
     * ViT-H width-crops a square crop before the backbone, so upstream scales
     * x by H/W for that backbone only. Rectangular DINOv3 does not. */
    float gxy_h[70 * 2];
    const int scale_x = (ctx->cfg.backbone == CUDA_SAM3D_BODY_BACKBONE_VITH);
    for (int i = 0; i < K; i++) {
        float gx = kp2d_cropped[i*2 + 0] * 2.0f;
        if (scale_x && W != H) gx *= (float)H / (float)W;
        gxy_h[i*2 + 0] = gx;
        gxy_h[i*2 + 1] = kp2d_cropped[i*2 + 1] * 2.0f;
    }

    /* Device buffers. */
    void *d_tokens = NULL, *d_aug = NULL, *d_img = NULL;
    void *d_gxy = NULL, *d_invalid = NULL;
    void *d_kp2d_in = NULL, *d_p_h = NULL, *d_p_o = NULL;
    void *d_kp_feats = NULL, *d_kp_proj = NULL;
    void *d_kp3d_in = NULL, *d_kp3d_norm = NULL;
    void *d_p3_h = NULL, *d_p3_o = NULL;

    size_t bx_q  = (size_t)N_q * D * sizeof(float);
    size_t b_img = (size_t)C * (size_t)H * (size_t)W * sizeof(float);
    size_t b_kpD = (size_t)K * D * sizeof(float);
    size_t b_kpC = (size_t)K * C * sizeof(float);
    size_t b_kp2 = (size_t)K * 2 * sizeof(float);
    size_t b_kp3 = (size_t)K * 3 * sizeof(float);
    size_t b_inv = (size_t)K * sizeof(int);

    if (hipMalloc(&d_tokens,    bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_aug,       bx_q) != hipSuccess) goto fail;
    if (hipMalloc(&d_img,       b_img) != hipSuccess) goto fail;
    if (hipMalloc(&d_gxy,       b_kp2) != hipSuccess) goto fail;
    if (hipMalloc(&d_invalid,   b_inv) != hipSuccess) goto fail;
    if (hipMalloc(&d_kp2d_in,   b_kp2) != hipSuccess) goto fail;
    if (hipMalloc(&d_p_h,       b_kpD) != hipSuccess) goto fail;
    if (hipMalloc(&d_p_o,       b_kpD) != hipSuccess) goto fail;
    if (hipMalloc(&d_kp_feats,  b_kpC) != hipSuccess) goto fail;
    if (hipMalloc(&d_kp_proj,   b_kpD) != hipSuccess) goto fail;
    if (hipMalloc(&d_kp3d_in,   b_kp3) != hipSuccess) goto fail;
    if (hipMalloc(&d_kp3d_norm, b_kp3) != hipSuccess) goto fail;
    if (hipMalloc(&d_p3_h,      b_kpD) != hipSuccess) goto fail;
    if (hipMalloc(&d_p3_o,      b_kpD) != hipSuccess) goto fail;

    if (hipMemcpy(d_tokens, tokens,        bx_q, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_aug,    token_augment, bx_q, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_img,    image_emb_chw, b_img, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_gxy,    gxy_h,         b_kp2, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_invalid, invalid_h,    b_inv, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_kp2d_in, kp2d_cropped, b_kp2, hipMemcpyHostToDevice) != hipSuccess) goto fail;
    if (hipMemcpy(d_kp3d_in, kp3d_camera,  b_kp3, hipMemcpyHostToDevice) != hipSuccess) goto fail;

    /* ---- 2D path -------------------------------------------------- */
    /* posemb_h = kp2d_in @ kp_posemb_l0_w^T + kp_posemb_l0_b  (K, 2 → K, D) */
    if (sb_dec_gemm(ctx, d_p_h, d_kp2d_in,
                    ctx->dec.kp_posemb_l0_w, ctx->dec.kp_posemb_l0_b,
                    K, 2, D) < 0) goto fail;
    if (sb_dec_relu(ctx, d_p_h, K * D) < 0) goto fail;
    /* posemb_o = posemb_h @ kp_posemb_l1_w^T + kp_posemb_l1_b  (K, D → K, D) */
    if (sb_dec_gemm(ctx, d_p_o, d_p_h,
                    ctx->dec.kp_posemb_l1_w, ctx->dec.kp_posemb_l1_b,
                    K, D, D) < 0) goto fail;
    /* augment[5..75) = invalid ? 0 : posemb_o */
    if (sb_dec_aug_overwrite(ctx, d_aug, kp2d_start, d_p_o, d_invalid,
                             K, D) < 0) goto fail;

    /* grid_sample image_emb at kp2d*2 (zeros padding); zero for invalid kp. */
    if (sb_dec_grid_sample(ctx, d_kp_feats, d_img, d_gxy, d_invalid,
                           K, C, H, W) < 0) goto fail;
    /* kp_proj = kp_feats @ kp_feat_linear_w^T + b   (K, C → K, D) */
    if (sb_dec_gemm(ctx, d_kp_proj, d_kp_feats,
                    ctx->dec.kp_feat_linear_w, ctx->dec.kp_feat_linear_b,
                    K, C, D) < 0) goto fail;
    /* tokens[5..75) += kp_proj  (size = K*D contiguous starting at row 5) */
    {
        float *d_tokens_kp = (float *)d_tokens + (size_t)kp2d_start * D;
        if (sb_dec_add_inplace(ctx, d_tokens_kp, d_kp_proj, K * D) < 0) goto fail;
    }

    /* ---- 3D path -------------------------------------------------- */
    if (sb_dec_pelvis_norm(ctx, d_kp3d_norm, d_kp3d_in, K) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_p3_h, d_kp3d_norm,
                    ctx->dec.kp3d_posemb_l0_w, ctx->dec.kp3d_posemb_l0_b,
                    K, 3, D) < 0) goto fail;
    if (sb_dec_relu(ctx, d_p3_h, K * D) < 0) goto fail;
    if (sb_dec_gemm(ctx, d_p3_o, d_p3_h,
                    ctx->dec.kp3d_posemb_l1_w, ctx->dec.kp3d_posemb_l1_b,
                    K, D, D) < 0) goto fail;
    /* augment[75..145) = posemb_3d  (no mask) */
    if (sb_dec_aug_overwrite(ctx, d_aug, kp3d_start, d_p3_o, NULL,
                             K, D) < 0) goto fail;

    /* Copy back. */
    if (hipMemcpy(tokens,        d_tokens, bx_q, hipMemcpyDeviceToHost) != hipSuccess) goto fail;
    if (hipMemcpy(token_augment, d_aug,    bx_q, hipMemcpyDeviceToHost) != hipSuccess) goto fail;

    hipFree(d_tokens); hipFree(d_aug); hipFree(d_img);
    hipFree(d_gxy); hipFree(d_invalid); hipFree(d_kp2d_in);
    hipFree(d_p_h); hipFree(d_p_o);
    hipFree(d_kp_feats); hipFree(d_kp_proj);
    hipFree(d_kp3d_in); hipFree(d_kp3d_norm);
    hipFree(d_p3_h); hipFree(d_p3_o);
    return 0;

