lighttransport/gemm/cuda/sam3d_body/cuda_sam3d_body_runner.c
fail:
    if (d_tokens) hipFree(d_tokens);
    if (d_aug) hipFree(d_aug);
    if (d_img) hipFree(d_img);
    if (d_gxy) hipFree(d_gxy);
    if (d_invalid) hipFree(d_invalid);
    if (d_kp2d_in) hipFree(d_kp2d_in);
    if (d_p_h) hipFree(d_p_h);
    if (d_p_o) hipFree(d_p_o);
    if (d_kp_feats) hipFree(d_kp_feats);
    if (d_kp_proj) hipFree(d_kp_proj);
    if (d_kp3d_in) hipFree(d_kp3d_in);
    if (d_kp3d_norm) hipFree(d_kp3d_norm);
    if (d_p3_h) hipFree(d_p3_h);
    if (d_p3_o) hipFree(d_p3_o);
    return CUDA_SAM3D_BODY_E_LOAD;
}

/* CPU implementation. Tail of the decoder (norm_final + 2 head MLPs)
 * has trivial compute (~2.6 MFLOP per call) and the outputs head straight
 * back to the host for MHR — running it on CPU avoids one full
 * tokens upload + GPU GEMM chain + multi-buffer download per call.
 * Math is identical to the prior NVRTC kernels: PyTorch LayerNorm
 * (eps=1e-6, biased variance) + Linear(W,b) + ReLU + Linear(W,b) on
 * the row-0 ("pose token") slot. */
int cuda_sam3d_body_debug_run_norm_and_heads(cuda_sam3d_body_ctx *ctx,
                                             const float *tokens_in,
                                             int N_q,
                                             float *tokens_norm,
                                             float *pose_raw,
                                             float *cam_raw)
{
    if (!ctx || !tokens_in || !pose_raw || !cam_raw)
        return CUDA_SAM3D_BODY_E_INVAL;
    if (!ctx->dec.loaded) return CUDA_SAM3D_BODY_E_INVAL;

    const int D  = SB_DEC_DIM;       /* 1024 */
    const int Np = SB_DEC_NPOSE;     /* 519  */
    const int Nc = SB_DEC_NCAM;      /* 3    */
    const float eps = 1e-6f;

    const float *gamma = ctx->dec.norm_final_w_h;
    const float *beta  = ctx->dec.norm_final_b_h;

    /* When the caller doesn't want all tokens LN'd, we still need row 0
     * (the pose token) for the head MLPs. */
    float row0_scratch[SB_DEC_DIM];
    const int n_rows = tokens_norm ? N_q : 1;
    int n_threads = SAM3DB_MHR_THREADS();
#if defined(_OPENMP)
    #pragma omp parallel for schedule(static) num_threads(n_threads)
#else
    (void)n_threads;
#endif
    for (int t = 0; t < n_rows; t++) {
        const float *src = tokens_in + (size_t)t * D;
        float *dst = tokens_norm ? tokens_norm + (size_t)t * D
                                 : row0_scratch;
        float mean = 0.0f;
        for (int j = 0; j < D; j++) mean += src[j];
        mean /= (float)D;
        float var = 0.0f;
        for (int j = 0; j < D; j++) {
            float d = src[j] - mean;
            var += d * d;
        }
        var /= (float)D;
        float inv = 1.0f / sqrtf(var + eps);
        for (int j = 0; j < D; j++) {
            dst[j] = (src[j] - mean) * inv * gamma[j] + beta[j];
        }
    }

    const float *pose_tok = tokens_norm ? tokens_norm : row0_scratch;

    /* head_pose: Linear(D->D) + ReLU + Linear(D->Np). */
    float h_buf[SB_DEC_DIM];
    cpu_gemm_f32(h_buf, ctx->dec.head_pose_l0_w_h,
                        ctx->dec.head_pose_l0_b_h,
                        pose_tok, /*n_tok=*/1, /*n_out=*/D, /*n_in=*/D,
                        n_threads);
    for (int j = 0; j < D; j++) if (h_buf[j] < 0.0f) h_buf[j] = 0.0f;
    cpu_gemm_f32(pose_raw, ctx->dec.head_pose_l1_w_h,
                           ctx->dec.head_pose_l1_b_h,
                           h_buf, 1, Np, D, n_threads);

    /* head_camera: Linear(D->D) + ReLU + Linear(D->Nc). */
    cpu_gemm_f32(h_buf, ctx->dec.head_camera_l0_w_h,
                        ctx->dec.head_camera_l0_b_h,
                        pose_tok, 1, D, D, n_threads);
    for (int j = 0; j < D; j++) if (h_buf[j] < 0.0f) h_buf[j] = 0.0f;
    cpu_gemm_f32(cam_raw, ctx->dec.head_camera_l1_w_h,
                          ctx->dec.head_camera_l1_b_h,
                          h_buf, 1, Nc, D, n_threads);

    return 0;
}

/* =====================================================================
 * Speculative MHR-on-GPU debug helpers (exploratory; off the production
 * path).
 *
 * Step 7 was officially CLOSED on 2026-04-25 via CPU OpenMP parallelization
 * of the pose_correctives 55317×3000 GEMV — see PORT.md. The full GPU
 * port (~1500 NVRTC lines, including weight caching for the 663 MB
 * pc_linear_weight) was deemed not worth the cost given the 5.9× CPU
 * speedup at 16 threads (MHR 183 ms → 31 ms / call).
 *
 * What lives here is a smaller exploration:
 *   - blend_shape       (45 → V*3)   — uses mhr_blend_combine_f32
 *   - face_expressions  (72 → V*3)   — uses mhr_blend_combine_f32
 *   - pose_correctives  (jp 127×7 → V*3) — host 6D+sparse+ReLU,
 *                                          GPU dense GEMV via gemm_f32_bias
 *
 * Weights are uploaded ephemerally on each call (no caching), so these
 * are NOT performance-tuned — they exist to validate the kernels and to
 * keep the option open if a future inference pattern ever wants only
 * blend_shape on GPU. verify_mhr.c diffs each helper against the CPU
 * reference and the diffs are bit-exact / 1-ULP.
 * ===================================================================== */

static int cuda_sam3d_body_run_blend_combine(cuda_sam3d_body_ctx *ctx,
                                             const float *coeffs,
                                             const float *vectors_host,
                                             const float *base_host,
                                             int N_basis,
                                             int V_d,
                                             float *out_host)
{
    void *d_coeffs = NULL, *d_vec = NULL, *d_base = NULL, *d_out = NULL;
    size_t b_coeffs = (size_t)N_basis * sizeof(float);
    size_t b_vec    = (size_t)N_basis * (size_t)V_d * sizeof(float);
    size_t b_base   = (size_t)V_d * sizeof(float);
    size_t b_out    = (size_t)V_d * sizeof(float);

    if (hipMalloc(&d_coeffs, b_coeffs) != hipSuccess) goto fail;
    if (hipMalloc(&d_vec,    b_vec)    != hipSuccess) goto fail;
    if (base_host && hipMalloc(&d_base, b_base) != hipSuccess) goto fail;
    if (hipMalloc(&d_out,    b_out)    != hipSuccess) goto fail;

